{
  "version": "1.0.0",
  "build": "GRCh38",
  "lastUpdated": "2024-01-15",
  "typeSummaries": [
    {
      "type": "herv",
      "displayName": "Ancient Virus DNA",
      "description": {
        "level3": "Pieces of old viruses that got stuck in our DNA long ago.",
        "level4": "DNA from viruses that infected our ancestors millions of years ago and became part of our genome.",
        "level5": "Remnants of retroviruses that inserted themselves into our ancestors' DNA millions of years ago.",
        "level6": "Human Endogenous Retroviruses (HERVs) are viral sequences integrated into our genome through ancient infections.",
        "level7": "HERVs are retroviral sequences that integrated into the germline of ancestral primates and were inherited vertically.",
        "level8": "Human Endogenous Retroviruses represent ~8% of the genome, derived from exogenous retroviral infections that integrated into germline cells."
      },
      "color": "#dc2626",
      "icon": "Bug",
      "percentOfGenome": 8
    },
    {
      "type": "line",
      "displayName": "Jumping Genes (LINEs)",
      "description": {
        "level3": "Bits of DNA that can copy themselves and move to new spots.",
        "level4": "DNA sequences that can make copies of themselves and jump to different places in your genome.",
        "level5": "Long stretches of DNA that can duplicate themselves and insert the copy elsewhere in the genome.",
        "level6": "Long Interspersed Nuclear Elements (LINEs) are autonomous retrotransposons capable of self-replication.",
        "level7": "LINEs are class I transposable elements that replicate through an RNA intermediate using reverse transcriptase.",
        "level8": "LINE elements, particularly LINE-1, are autonomous non-LTR retrotransposons constituting ~17% of the human genome with ongoing activity."
      },
      "color": "#2563eb",
      "icon": "Repeat",
      "percentOfGenome": 17
    },
    {
      "type": "sine",
      "displayName": "Alu Elements",
      "description": {
        "level3": "Tiny pieces of DNA that copied themselves over a million times!",
        "level4": "Small bits of DNA that have duplicated themselves over and over, appearing more than a million times.",
        "level5": "Short DNA sequences that have proliferated to over a million copies throughout the human genome.",
        "level6": "SINEs (Short Interspersed Nuclear Elements) like Alu are non-autonomous elements that hijack LINE machinery to copy themselves.",
        "level7": "Alu elements are primate-specific SINEs that depend on LINE-1 proteins for retrotransposition, numbering over 1 million copies.",
        "level8": "Alu elements are ~300bp non-autonomous retrotransposons comprising ~11% of the genome, retrotranspositionally active via LINE-1 machinery."
      },
      "color": "#7c3aed",
      "icon": "Copy",
      "percentOfGenome": 11
    },
    {
      "type": "pseudogene",
      "displayName": "Fossil Genes",
      "description": {
        "level3": "Broken copies of genes that don't work anymore, like fossils in your DNA.",
        "level4": "Old copies of genes that have broken down over time and no longer make proteins.",
        "level5": "Non-functional copies of genes that accumulated mutations and can no longer produce working proteins.",
        "level6": "Pseudogenes are defunct relatives of functional genes that have lost their protein-coding ability through mutations.",
        "level7": "Pseudogenes arise through duplication or retrotransposition and accumulate disabling mutations while preserving sequence similarity to parent genes.",
        "level8": "Pseudogenes are genomic sequences with homology to functional genes but rendered non-functional by frameshift mutations, premature stops, or regulatory defects."
      },
      "color": "#78716c",
      "icon": "Skull",
      "percentOfGenome": 1.5
    },
    {
      "type": "dna_transposon",
      "displayName": "Cut-and-Paste Genes",
      "description": {
        "level3": "DNA pieces that used to be able to cut themselves out and paste somewhere else.",
        "level4": "Ancient DNA sequences that could move around by cutting themselves out and inserting elsewhere.",
        "level5": "DNA transposons that historically moved via a cut-and-paste mechanism, though most are now inactive.",
        "level6": "DNA transposons are Class II transposable elements that mobilized via transposase-mediated excision and reinsertion.",
        "level7": "DNA transposons moved through a conservative cut-and-paste mechanism, unlike retrotransposons' replicative copy-and-paste method.",
        "level8": "DNA transposons constitute ~3% of the genome, mobilizing via transposase enzymes, though all human copies became inactive ~37 MYA."
      },
      "color": "#ea580c",
      "icon": "Scissors",
      "percentOfGenome": 3
    },
    {
      "type": "numt",
      "displayName": "Mitochondrial Ghosts",
      "description": {
        "level3": "Copies of mitochondria DNA that jumped into your main chromosomes!",
        "level4": "Ancient pieces of mitochondrial DNA that escaped and inserted into your nuclear chromosomes.",
        "level5": "Nuclear copies of mitochondrial DNA sequences that transferred from mitochondria to nuclear chromosomes.",
        "level6": "NUMTs (Nuclear Mitochondrial DNA segments) are mitochondrial sequences integrated into nuclear chromosomes.",
        "level7": "NUMTs represent ongoing DNA transfer from mitochondria to nucleus, with ~750 insertions totaling ~600kb in the human genome.",
        "level8": "Nuclear mitochondrial DNA transfers (NUMTs) provide a molecular fossil record of mitochondrial evolution and can complicate forensic/medical mtDNA analysis."
      },
      "color": "#14b8a6",
      "icon": "Zap",
      "percentOfGenome": 0.02
    },
    {
      "type": "har",
      "displayName": "Human Accelerated Regions",
      "description": {
        "level3": "Special parts of DNA that changed super fast only in humans - maybe what makes us unique!",
        "level4": "DNA regions that stayed the same in animals for millions of years but changed rapidly in humans.",
        "level5": "Genomic regions highly conserved across mammals but showing accelerated evolution specifically in humans.",
        "level6": "Human Accelerated Regions (HARs) show significant nucleotide substitutions in humans despite deep conservation across vertebrates.",
        "level7": "HARs represent sequences under strong purifying selection for >300 million years that experienced positive selection in the human lineage.",
        "level8": "Human Accelerated Regions exhibit statistically significant human-specific substitution rates, often in non-coding regulatory regions near neurodevelopmental genes."
      },
      "color": "#f59e0b",
      "icon": "Zap",
      "percentOfGenome": 0.001
    },
    {
      "type": "neanderthal",
      "displayName": "Neanderthal DNA",
      "description": {
        "level3": "DNA we got from Neanderthals when humans and Neanderthals had kids together long ago!",
        "level4": "Pieces of Neanderthal DNA that entered human genomes when our ancestors met and had children with Neanderthals.",
        "level5": "Genomic regions inherited from Neanderthals through interbreeding ~50,000-60,000 years ago.",
        "level6": "Neanderthal introgression regions represent archaic hominin DNA acquired through hybridization events in Eurasia.",
        "level7": "Introgressed Neanderthal haplotypes comprise ~2% of non-African genomes, with some regions showing adaptive significance.",
        "level8": "Neanderthal-derived sequences show complex patterns of selection, with some haplotypes under positive selection (immune genes) and others depleted (hybrid incompatibility)."
      },
      "color": "#8b5cf6",
      "icon": "Users",
      "percentOfGenome": 2
    },
    {
      "type": "gene_desert",
      "displayName": "Gene Deserts",
      "description": {
        "level3": "Huge stretches of DNA with no genes at all - like empty deserts in your genome!",
        "level4": "Very large regions of DNA that contain no protein-coding genes - we're not sure why they exist.",
        "level5": "Extended genomic regions spanning millions of bases that lack any protein-coding genes.",
        "level6": "Gene deserts are megabase-scale regions devoid of protein-coding genes, often containing important regulatory elements.",
        "level7": "Gene deserts may harbor long-range enhancers, conserved non-coding elements, or represent evolutionary remnants.",
        "level8": "Gene deserts often contain crucial cis-regulatory elements controlling distant developmental genes, explaining their evolutionary conservation despite lacking coding sequences."
      },
      "color": "#fbbf24",
      "icon": "MapPin",
      "percentOfGenome": 25
    },
    {
      "type": "denisovan",
      "displayName": "Denisovan DNA",
      "description": {
        "level3": "DNA we got from Denisovans - mysterious ancient humans we know mostly from their DNA!",
        "level4": "Pieces of Denisovan DNA that entered human genomes through ancient interbreeding.",
        "level5": "Genomic regions inherited from Denisovans, a sister group to Neanderthals known mainly from genetics.",
        "level6": "Denisovan introgression regions represent archaic hominin DNA from a population identified in 2010.",
        "level7": "Denisovan DNA comprises up to 6% of some Oceanian genomes, with evidence for multiple introgression events.",
        "level8": "Denisovan introgression shows complex geographic distribution, with highest levels in Melanesia and distinct contributions in different populations."
      },
      "color": "#0891b2",
      "icon": "Users",
      "percentOfGenome": 0.5
    },
    {
      "type": "archaic",
      "displayName": "Archaic Human DNA",
      "description": {
        "level3": "DNA from ancient human relatives like Neanderthals and Denisovans!",
        "level4": "Genetic material inherited from multiple ancient human species that bred with our ancestors.",
        "level5": "Genomic regions showing signatures of introgression from multiple archaic human populations.",
        "level6": "Archaic introgression from both Neanderthal and Denisovan sources, sometimes overlapping.",
        "level7": "Some genomic regions show introgression from multiple archaic sources with complex selection histories.",
        "level8": "Archaic DNA mapping reveals complex admixture history with multiple hominin lineages contributing to modern human genetic variation."
      },
      "color": "#a855f7",
      "icon": "Users",
      "percentOfGenome": 2.5
    },
    {
      "type": "fusion",
      "displayName": "Chromosomal Fusion",
      "description": {
        "level3": "Places where old chromosomes stuck together to make new ones!",
        "level4": "Sites where ancestral chromosomes fused together during human evolution.",
        "level5": "Chromosomal fusion sites that explain why humans have 46 chromosomes while apes have 48.",
        "level6": "Telomere-to-telomere fusion events that restructured the human karyotype during evolution.",
        "level7": "Chromosomal fusion sites contain diagnostic signatures like interstitial telomeres and vestigial centromeres.",
        "level8": "Chromosomal fusions represent major karyotypic changes with retained molecular signatures serving as evolutionary landmarks."
      },
      "color": "#e11d48",
      "icon": "GitMerge",
      "percentOfGenome": 0.001
    },
    {
      "type": "disease_gene",
      "displayName": "Disease Genes",
      "description": {
        "level3": "Genes that can cause diseases when they don't work right.",
        "level4": "Important genes that cause known genetic diseases when mutated.",
        "level5": "Genes with well-established roles in human genetic disorders, from rare to common diseases.",
        "level6": "Disease-associated genes with clinical significance for diagnosis, prognosis, or treatment.",
        "level7": "Genes with pathogenic variants causing Mendelian disorders or significantly modifying complex disease risk.",
        "level8": "Clinically actionable genes with established genotype-phenotype correlations and evidence-based management guidelines."
      },
      "color": "#ef4444",
      "icon": "Heart",
      "percentOfGenome": 2
    },
    {
      "type": "human_specific",
      "displayName": "Human-Specific Features",
      "description": {
        "level3": "Things in DNA that only humans have - not chimps, gorillas, or any other animal!",
        "level4": "Genetic features unique to humans that evolved after we split from other apes.",
        "level5": "Genomic elements unique to humans, including duplications, deletions, and accelerated regions.",
        "level6": "Human-specific genetic changes including gene duplications, losses, and regulatory modifications.",
        "level7": "Human lineage-specific genomic features arising since the human-chimpanzee divergence ~6-7 MYA.",
        "level8": "Human-specific genomic changes encompass structural variants, accelerated sequences, and novel genes arising through various mutational mechanisms."
      },
      "color": "#ec4899",
      "icon": "User",
      "percentOfGenome": 0.5
    },
    {
      "type": "longevity",
      "displayName": "Longevity Regions",
      "description": {
        "level3": "Gene regions that might help some people live extra long lives!",
        "level4": "Genes associated with living to very old ages, found by studying centenarians.",
        "level5": "Genomic regions containing variants associated with exceptional longevity and healthy aging.",
        "level6": "Longevity-associated loci identified through centenarian studies and aging research.",
        "level7": "Genes with replicated associations to exceptional longevity, often involved in stress response and metabolism.",
        "level8": "Validated longevity loci with mechanistic links to conserved aging pathways including insulin/IGF-1, mTOR, and sirtuins."
      },
      "color": "#22c55e",
      "icon": "Clock",
      "percentOfGenome": 0.01
    }
  ],
  "features": [
    {
      "id": "herv_syncytin1",
      "name": "Syncytin-1",
      "type": "herv",
      "subtype": "HERV-W",
      "chromosome": "7",
      "start": 92470496,
      "end": 92480871,
      "strand": "-",
      "nickname": "The Pregnancy Virus Gene",
      "color": "#dc2626",
      "icon": "Baby",
      "shortDescription": {
        "level3": "An old virus gene that helps babies grow inside their moms!",
        "level4": "A gene from an ancient virus that now helps connect babies to their mothers during pregnancy.",
        "level5": "A former viral gene that evolved to help form the placenta, connecting mother and baby.",
        "level6": "An endogenous retroviral envelope gene co-opted for placental syncytiotrophoblast fusion.",
        "level7": "HERV-W derived Syncytin-1 mediates cell-cell fusion in placental development, demonstrating viral domestication.",
        "level8": "Syncytin-1 (ERVW-1) is a fusogenic envelope protein derived from HERV-W, essential for syncytiotrophoblast formation."
      },
      "funFact": {
        "level3": "Without this old virus, mammals might not be able to have babies the way we do!",
        "level4": "This virus DNA was captured about 25 million years ago and became essential for pregnancy!",
        "level5": "We essentially repurposed a virus infection to help with pregnancy - talk about making lemonade from lemons!",
        "level6": "Syncytin-1 demonstrates exaptation: a viral gene repurposed for essential host function.",
        "level7": "Multiple mammals independently captured different retroviral envelopes for placentation - convergent evolution at its finest.",
        "level8": "Syncytins represent one of the clearest examples of retroviral domestication across mammalian evolution."
      },
      "ageEstimate": "~25 million years",
      "isActive": false,
      "functionKnown": "Essential for placenta formation",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["pregnancy", "essential", "domesticated-virus"]
    },
    {
      "id": "herv_syncytin2",
      "name": "Syncytin-2",
      "type": "herv",
      "subtype": "HERV-FRD",
      "chromosome": "6",
      "start": 11118934,
      "end": 11128556,
      "strand": "+",
      "nickname": "The Other Pregnancy Helper",
      "color": "#dc2626",
      "icon": "Baby",
      "shortDescription": {
        "level3": "Another virus gene that helps with having babies.",
        "level4": "A second viral gene that helps protect babies in the womb.",
        "level5": "Another domesticated viral gene involved in placental development and immune protection.",
        "level6": "A second retroviral envelope gene with immunosuppressive and fusogenic functions in the placenta.",
        "level7": "HERV-FRD derived Syncytin-2 has both fusogenic and immunosuppressive properties for fetomaternal tolerance.",
        "level8": "Syncytin-2 (ERVFRD-1) provides both cell fusion capability and immunomodulatory function at the maternal-fetal interface."
      },
      "ageEstimate": "~40 million years",
      "isActive": false,
      "functionKnown": "Placenta formation and immune tolerance",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["pregnancy", "essential", "immune"]
    },
    {
      "id": "herv_k_active",
      "name": "HERV-K (HML-2)",
      "type": "herv",
      "subtype": "HERV-K",
      "chromosome": "12",
      "start": 58721242,
      "end": 58730543,
      "strand": "+",
      "nickname": "The Youngest Virus",
      "color": "#dc2626",
      "icon": "Bug",
      "shortDescription": {
        "level3": "The most recent virus that got stuck in human DNA - only about 200,000 years ago!",
        "level4": "The newest virus DNA in humans, inserted around the time modern humans appeared.",
        "level5": "The most recently active human endogenous retrovirus, with some copies still potentially active.",
        "level6": "HERV-K HML-2 represents the youngest HERV family with human-specific insertions and residual coding capacity.",
        "level7": "HERV-K (HML-2) is the only HERV family with human-specific members, some retaining open reading frames.",
        "level8": "HERV-K HML-2 elements include human-specific proviruses with intact ORFs, suggesting recent (<1MYA) and possibly ongoing activity."
      },
      "funFact": {
        "level3": "Some scientists think this virus might still be able to wake up!",
        "level4": "This is so young (for virus DNA) that different people have different copies!",
        "level5": "HERV-K is polymorphic - meaning some people have copies that others don't!",
        "level6": "Some HERV-K insertions are present in only some humans, indicating very recent integration.",
        "level7": "HERV-K polymorphism and potential somatic activity make it unique among human ERVs.",
        "level8": "HERV-K HML-2 shows human-specific polymorphic insertions and evidence of somatic activity in certain pathological conditions."
      },
      "ageEstimate": "200,000 - 5 million years",
      "isActive": true,
      "functionKnown": "Unknown, possibly involved in some diseases",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["recent", "polymorphic", "potentially-active"]
    },
    {
      "id": "line1_active",
      "name": "Active LINE-1",
      "type": "line",
      "subtype": "L1HS",
      "chromosome": "22",
      "start": 29059272,
      "end": 29065348,
      "strand": "+",
      "nickname": "The Still-Jumping Gene",
      "color": "#2563eb",
      "icon": "Repeat",
      "shortDescription": {
        "level3": "A piece of DNA that can still copy itself and move around!",
        "level4": "One of about 100 LINE-1 elements that can still actively jump around in your genome.",
        "level5": "An active retrotransposon that continues to make new copies of itself in human cells.",
        "level6": "A full-length, retrotranspositionally competent LINE-1 element with intact ORFs.",
        "level7": "Active L1HS elements retain functional ORF1p and ORF2p for autonomous retrotransposition.",
        "level8": "This full-length L1HS element (~6kb) contains intact ORF1 (RNA chaperone) and ORF2 (RT/EN) for autonomous mobilization."
      },
      "funFact": {
        "level3": "These jumping genes are still making new copies in your cells right now!",
        "level4": "Out of 500,000 LINE-1 copies, only about 100 can still jump - but they do!",
        "level5": "LINE-1 elements cause about 1 in every 250 disease-causing mutations in humans.",
        "level6": "Active LINE-1s contribute to somatic mosaicism and can cause insertional mutagenesis.",
        "level7": "L1 retrotransposition generates ~80-100 novel insertions per individual per generation.",
        "level8": "Active L1 elements drive ongoing genomic evolution, contributing to structural variation and disease mutations."
      },
      "ageEstimate": "Still active",
      "percentOfGenome": 17,
      "isActive": true,
      "functionKnown": "Creates genomic diversity, sometimes causes disease",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["active", "jumping-gene", "evolution"]
    },
    {
      "id": "line1_disease",
      "name": "Hemophilia LINE-1",
      "type": "line",
      "subtype": "L1",
      "chromosome": "X",
      "start": 139530556,
      "end": 139536632,
      "strand": "-",
      "nickname": "The Disease-Causing Jumper",
      "color": "#2563eb",
      "icon": "AlertTriangle",
      "shortDescription": {
        "level3": "A jumping gene that landed in the wrong spot and causes a blood disease.",
        "level4": "A LINE-1 that jumped into an important gene and caused the first known disease from a jumping gene.",
        "level5": "The first documented case of a transposon insertion causing human disease - hemophilia A.",
        "level6": "A LINE-1 insertion in the Factor VIII gene, the first identified retrotransposon-mediated human disease.",
        "level7": "This L1 insertion in F8 intron 14 was the first demonstration of L1 retrotransposition causing human genetic disease.",
        "level8": "The F8 L1 insertion (1988) established L1 as an active mutagen, disrupting Factor VIII expression and causing hemophilia A."
      },
      "ageEstimate": "Recent (within patient's germline)",
      "isActive": false,
      "functionKnown": "Caused hemophilia A (first documented case)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["disease", "historic-discovery", "mutation"]
    },
    {
      "id": "alu_disease_hotspot",
      "name": "BRCA1 Alu Cluster",
      "type": "sine",
      "subtype": "Alu",
      "chromosome": "17",
      "start": 43044295,
      "end": 43125364,
      "strand": ".",
      "nickname": "The Recombination Trap",
      "color": "#7c3aed",
      "icon": "Copy",
      "shortDescription": {
        "level3": "A bunch of copied DNA bits that sometimes cause mix-ups in an important cancer gene.",
        "level4": "Many Alu copies clustered together that can cause errors when DNA is copied.",
        "level5": "A region dense with Alu elements that promotes harmful recombination in the BRCA1 gene.",
        "level6": "An Alu-rich region in BRCA1 that facilitates pathogenic Alu-mediated deletions and duplications.",
        "level7": "The high Alu density in BRCA1 (~40% of gene) predisposes to non-allelic homologous recombination events.",
        "level8": "BRCA1's exceptionally high Alu content drives Alu-Alu mediated rearrangements, accounting for ~10% of pathogenic variants."
      },
      "ageEstimate": "Various ages (30-65 million years)",
      "percentOfGenome": 11,
      "isActive": false,
      "functionKnown": "Causes genomic instability, contributes to BRCA1 mutations",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["disease", "recombination", "cancer-gene"]
    },
    {
      "id": "alu_neuro",
      "name": "Brain-Active Alu",
      "type": "sine",
      "subtype": "AluY",
      "chromosome": "1",
      "start": 155235824,
      "end": 155236124,
      "strand": "+",
      "nickname": "The Brain Jumper",
      "color": "#7c3aed",
      "icon": "Brain",
      "shortDescription": {
        "level3": "A copy-paste gene piece that's active in brain cells.",
        "level4": "An Alu element that can still jump around, especially in brain cells.",
        "level5": "An active Alu element that retrotransposes in neural progenitor cells, contributing to brain diversity.",
        "level6": "Alu elements show increased retrotransposition in neural progenitors, creating somatic mosaicism.",
        "level7": "L1/Alu activity in neural progenitor cells generates somatic insertions contributing to neuronal diversity.",
        "level8": "Somatic retrotransposition of Alu elements in NPCs contributes to neuronal genome mosaicism and potentially neural diversity."
      },
      "funFact": {
        "level3": "Your brain cells might each have slightly different DNA because of jumping genes!",
        "level4": "Jumping genes are more active in brain cells, making each neuron slightly unique!",
        "level5": "L1 and Alu activity in the brain means your neurons aren't all genetically identical.",
        "level6": "Somatic retrotransposition creates neuronal mosaicism - each brain cell may have unique insertions.",
        "level7": "Neural retrotransposition may contribute to neural circuit diversity and plasticity.",
        "level8": "Elevated L1/Alu somatic activity in neurons may contribute to neural diversity, though functional significance remains debated."
      },
      "ageEstimate": "Ongoing",
      "isActive": true,
      "functionKnown": "May contribute to neural diversity",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["brain", "active", "mosaicism"]
    },
    {
      "id": "pseudogene_olfactory",
      "name": "Olfactory Pseudogene Cluster",
      "type": "pseudogene",
      "subtype": "Processed",
      "chromosome": "11",
      "start": 4923447,
      "end": 5986682,
      "strand": ".",
      "nickname": "The Lost Smell Genes",
      "color": "#78716c",
      "icon": "Wind",
      "shortDescription": {
        "level3": "Old smell genes that stopped working when our ancestors started using their eyes more.",
        "level4": "Broken copies of smell genes - we lost many when vision became more important.",
        "level5": "A cluster of non-functional olfactory receptor genes, remnants of our more smell-dependent ancestors.",
        "level6": "Olfactory receptor pseudogenes representing the decline of smell as humans evolved better color vision.",
        "level7": "The OR gene family shows massive pseudogenization (~60%) correlating with the evolution of trichromatic vision.",
        "level8": "Human olfactory receptor pseudogenes reflect relaxed selection following trichromacy acquisition and olfaction's reduced fitness contribution."
      },
      "funFact": {
        "level3": "Dogs have way fewer broken smell genes, which is why their noses are so much better!",
        "level4": "We have about 400 working smell genes but over 600 broken ones!",
        "level5": "Humans have ~400 functional OR genes but ~600 pseudogenes - dogs have far fewer pseudogenes!",
        "level6": "The human OR repertoire is ~40% functional vs ~80% in dogs, reflecting our visual vs olfactory lifestyle.",
        "level7": "OR pseudogenization accelerated in the catarrhine lineage coincident with full trichromacy evolution.",
        "level8": "Comparative genomics reveals OR pseudogenization rates correlate inversely with olfactory dependence across mammals."
      },
      "ageEstimate": "25-40 million years",
      "isActive": false,
      "functionKnown": "None (fossil of ancestral smell ability)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "smell", "vision-tradeoff"]
    },
    {
      "id": "pseudogene_vitamin_c",
      "name": "GULOP (Vitamin C Gene)",
      "type": "pseudogene",
      "subtype": "Unitary",
      "chromosome": "8",
      "start": 27361291,
      "end": 27386181,
      "strand": "-",
      "nickname": "Why We Need Orange Juice",
      "color": "#78716c",
      "icon": "CircleDot",
      "shortDescription": {
        "level3": "A broken gene that means humans can't make their own Vitamin C!",
        "level4": "The reason we need to eat fruits and vegetables - this gene broke millions of years ago.",
        "level5": "A non-functional vitamin C synthesis gene, explaining why humans require dietary vitamin C.",
        "level6": "GULOP pseudogene lost function ~40 MYA, making vitamin C an essential dietary nutrient for primates.",
        "level7": "The GULO pseudogene contains multiple disabling mutations shared with other simian primates.",
        "level8": "GULOP (L-gulonolactone oxidase pseudogene) carries shared-derived mutations establishing vitamin C auxotrophy in Haplorrhini."
      },
      "funFact": {
        "level3": "Most animals make their own Vitamin C, but we have to eat it because this gene broke!",
        "level4": "Sailors used to get sick (scurvy) because they didn't know they needed vitamin C - blame this gene!",
        "level5": "This broken gene is why scurvy plagued sailors - we can't synthesize vitamin C like most mammals.",
        "level6": "Guinea pigs independently broke their GULO gene, making them useful scurvy research models.",
        "level7": "GULO pseudogenization occurred independently in guinea pigs, some bats, and passerine birds.",
        "level8": "Multiple independent GULO losses across mammals demonstrate parallel evolution under fruit-rich dietary conditions."
      },
      "ageEstimate": "~40 million years",
      "isActive": false,
      "functionKnown": "None (explains vitamin C dietary requirement)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "nutrition", "scurvy"]
    },
    {
      "id": "pseudogene_egg_yolk",
      "name": "Vitellogenin Pseudogenes",
      "type": "pseudogene",
      "subtype": "Unitary",
      "chromosome": "1",
      "start": 2845732,
      "end": 2891643,
      "strand": "+",
      "nickname": "Lost Egg Genes",
      "color": "#78716c",
      "icon": "Egg",
      "shortDescription": {
        "level3": "Broken egg-making genes from when our ancient ancestors laid eggs!",
        "level4": "Leftover genes from egg-laying ancestors - proof that mammals evolved from egg-layers.",
        "level5": "Remnants of vitellogenin genes used by our egg-laying ancestors, replaced by lactation.",
        "level6": "Vitellogenin pseudogenes trace mammalian evolution from oviparity to viviparity and lactation.",
        "level7": "VIT pseudogenization correlates temporally with casein gene expansion during lactation evolution.",
        "level8": "Human vitellogenin pseudogenes show stepwise inactivation coinciding with casein gene family expansion ~100-300 MYA."
      },
      "funFact": {
        "level3": "We still have broken egg genes because we evolved from animals that laid eggs!",
        "level4": "When mammals evolved to make milk, we didn't need egg yolk genes anymore - but they're still there, broken!",
        "level5": "The vitellogenin genes broke as casein (milk protein) genes evolved - we traded eggs for milk!",
        "level6": "Vitellogenin loss and casein emergence show clear evolutionary tradeoff timing.",
        "level7": "The VIT/casein evolutionary transition is a textbook example of gene family replacement.",
        "level8": "VIT pseudogenization dates align with casein gene family radiation, demonstrating molecular basis for oviparity-viviparity transition."
      },
      "ageEstimate": "~100-170 million years",
      "isActive": false,
      "functionKnown": "None (evolutionary relic of egg-laying ancestors)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "mammals", "eggs-to-milk"]
    },
    {
      "id": "transposon_charlie",
      "name": "Charlie Element",
      "type": "dna_transposon",
      "subtype": "hAT-Charlie",
      "chromosome": "2",
      "start": 132456789,
      "end": 132458234,
      "strand": "+",
      "nickname": "The Friendly Fossil",
      "color": "#ea580c",
      "icon": "Scissors",
      "shortDescription": {
        "level3": "An ancient jumping gene that stopped jumping millions of years ago.",
        "level4": "A cut-and-paste gene that was active in our distant ancestors but is now a DNA fossil.",
        "level5": "A DNA transposon that was active in early mammals but became immobile ~37 million years ago.",
        "level6": "A hAT-superfamily DNA transposon, part of the Charlie/MER family inactive since ~37 MYA.",
        "level7": "Charlie elements are non-autonomous hAT derivatives that mobilized via ancestral autonomous copies.",
        "level8": "Charlie family elements represent MITEs derived from hAT-family transposons, with activity ceasing in the primate lineage."
      },
      "ageEstimate": "~37 million years (inactive)",
      "isActive": false,
      "functionKnown": "None (genomic fossil)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["fossil", "ancient", "cut-and-paste"]
    },
    {
      "id": "herv_arc",
      "name": "Arc (Activity-Regulated Gene)",
      "type": "herv",
      "subtype": "Ty3/Gypsy",
      "chromosome": "8",
      "start": 142621946,
      "end": 142625963,
      "strand": "-",
      "nickname": "The Memory Virus Gene",
      "color": "#dc2626",
      "icon": "Brain",
      "shortDescription": {
        "level3": "A virus gene that became super important for making memories!",
        "level4": "An ancient virus gene that your brain uses to form and store memories.",
        "level5": "A gene derived from a retrotransposon that's essential for memory formation in the brain.",
        "level6": "Arc encodes a Gag-like protein that forms capsid-like structures for intercellular mRNA transport.",
        "level7": "Arc protein assembles into virus-like capsids that transfer mRNA between neurons for synaptic plasticity.",
        "level8": "Arc represents an exapted Ty3/Gypsy Gag protein that forms capsid-like particles mediating intercellular mRNA transfer at synapses."
      },
      "funFact": {
        "level3": "This virus gene helps your brain cells talk to each other to make memories!",
        "level4": "Arc protein actually makes little virus-like shells to send messages between brain cells!",
        "level5": "Arc makes capsid-like structures (like virus shells) to transport RNA between neurons!",
        "level6": "Arc represents a striking example of viral gene domestication for neural function.",
        "level7": "Arc's virus-like mRNA delivery mechanism suggests retroviral exaptation for neural circuit function.",
        "level8": "Arc exemplifies molecular domestication where Gag's capsid-forming ability was repurposed for synaptic plasticity."
      },
      "ageEstimate": "~350-400 million years",
      "isActive": false,
      "functionKnown": "Essential for memory formation",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["memory", "brain", "domesticated-virus", "essential"]
    },
    {
      "id": "pseudogene_myosin",
      "name": "MYH16 (Jaw Muscle Gene)",
      "type": "pseudogene",
      "subtype": "Unitary",
      "chromosome": "7",
      "start": 100917379,
      "end": 100971513,
      "strand": "-",
      "nickname": "The Brain Space Maker",
      "color": "#78716c",
      "icon": "Bone",
      "shortDescription": {
        "level3": "A muscle gene that broke, letting our heads get bigger for bigger brains!",
        "level4": "A jaw muscle gene that stopped working, possibly letting human skulls grow larger.",
        "level5": "A myosin gene inactivated ~2.4 MYA, coinciding with brain expansion in human evolution.",
        "level6": "MYH16 pseudogenization may have relaxed constraints on skull size, facilitating encephalization.",
        "level7": "The MYH16 inactivating mutation (~2.4 MYA) correlates with reduced masticatory musculature and cranial expansion.",
        "level8": "MYH16 carries a 2-bp deletion creating a frameshift, dated to ~2.4 MYA coincident with Homo brain expansion."
      },
      "funFact": {
        "level3": "Some scientists think breaking this gene helped humans grow bigger brains!",
        "level4": "Weaker jaw muscles might have let our skulls grow bigger to fit larger brains!",
        "level5": "The timing of this gene breaking matches perfectly with when human brains started getting bigger!",
        "level6": "This hypothesis links masticatory muscle reduction to relaxed cranial constraint.",
        "level7": "While correlation is striking, causation between MYH16 loss and encephalization remains debated.",
        "level8": "The MYH16-encephalization hypothesis remains controversial, though temporal correlation is notable."
      },
      "ageEstimate": "~2.4 million years",
      "isActive": false,
      "functionKnown": "None (possibly enabled brain expansion)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["evolution", "brain", "human-specific"]
    },
    {
      "id": "line1_x_inactivation",
      "name": "X-Chromosome LINE Repeats",
      "type": "line",
      "subtype": "L1",
      "chromosome": "X",
      "start": 73820000,
      "end": 73920000,
      "strand": ".",
      "nickname": "The Silencing Signals",
      "color": "#2563eb",
      "icon": "VolumeX",
      "shortDescription": {
        "level3": "Special markers that help turn off one X chromosome in girls.",
        "level4": "LINE elements that help silence one X chromosome in females, so they don't have double the genes.",
        "level5": "LINE-1 elements enriched on the X chromosome that may facilitate X-inactivation spreading.",
        "level6": "X-chromosome LINE density correlates with X-inactivation efficiency, possibly serving as way stations.",
        "level7": "Lyon's 'way station' hypothesis suggests LINEs propagate heterochromatin during X-inactivation.",
        "level8": "X-chromosome L1 enrichment (~30% vs ~17% autosomal) may facilitate XIST-mediated silencing propagation."
      },
      "funFact": {
        "level3": "Girls have two X chromosomes but only use one - these DNA bits help pick which one!",
        "level4": "The X chromosome has almost twice as many LINE elements as other chromosomes!",
        "level5": "The X chromosome is 30% LINEs (vs 17% elsewhere) - this may help with X-inactivation!",
        "level6": "The 2-fold LINE enrichment on X chromosomes is a striking genomic feature with functional implications.",
        "level7": "X-linked LINE enrichment is conserved across mammals, supporting functional significance.",
        "level8": "Lyon's way-station hypothesis for LINE-mediated X-inactivation spreading remains supported by genomic and functional data."
      },
      "percentOfGenome": 30,
      "isActive": false,
      "functionKnown": "May help spread X-chromosome inactivation",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["x-chromosome", "gene-regulation", "females"]
    },
    {
      "id": "herv_immunity",
      "name": "HERV Immune Regulators",
      "type": "herv",
      "subtype": "Multiple",
      "chromosome": "19",
      "start": 54700000,
      "end": 54800000,
      "strand": ".",
      "nickname": "The Immune Training Grounds",
      "color": "#dc2626",
      "icon": "Shield",
      "shortDescription": {
        "level3": "Old virus bits that help train our immune system!",
        "level4": "HERV sequences that evolved to help regulate how our immune system works.",
        "level5": "Endogenous retroviruses co-opted for interferon response and immune regulation.",
        "level6": "Multiple HERV-derived sequences serve as interferon-stimulated enhancers and immune regulators.",
        "level7": "ERV-derived sequences constitute a significant fraction of primate-specific interferon response elements.",
        "level8": "HERV LTRs provide species-specific cis-regulatory elements for innate immunity genes, particularly in interferon pathways."
      },
      "funFact": {
        "level3": "These old viruses now help us fight new viruses - they switched sides!",
        "level4": "Ancient viruses that once tried to infect us now help our immune system fight other infections!",
        "level5": "ERVs contribute many regulatory elements to our immune response - former enemies turned allies!",
        "level6": "About 20% of human interferon response elements derive from endogenous retroviruses.",
        "level7": "ERV-derived regulatory elements show species-specific immune response patterns.",
        "level8": "ERV domestication for innate immunity represents ongoing host-virus co-evolution with functional consequences."
      },
      "ageEstimate": "Various (millions of years)",
      "isActive": false,
      "functionKnown": "Immune system regulation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["immunity", "regulation", "domesticated-virus"]
    },
    {
      "id": "pseudogene_taste",
      "name": "TAS2R Bitter Receptor Pseudogenes",
      "type": "pseudogene",
      "subtype": "Processed",
      "chromosome": "12",
      "start": 10950000,
      "end": 11150000,
      "strand": ".",
      "nickname": "The Lost Bitter Detectors",
      "color": "#78716c",
      "icon": "Angry",
      "shortDescription": {
        "level3": "Broken taste genes that used to help us detect more bitter things.",
        "level4": "Non-working bitter taste receptor genes, showing we've lost some taste sensitivity.",
        "level5": "Pseudogenized bitter taste receptors reflecting dietary changes in human evolution.",
        "level6": "TAS2R pseudogenes represent relaxed selection on bitter detection as diet shifted.",
        "level7": "Human TAS2R pseudogenization varies by population, reflecting local dietary adaptation.",
        "level8": "TAS2R pseudogene variation shows population-specific patterns correlating with historical dietary toxin exposure."
      },
      "funFact": {
        "level3": "Different people have different broken taste genes, so we all taste things a bit differently!",
        "level4": "Some bitter taste genes are broken in some people but not others - that's why we like different foods!",
        "level5": "TAS2R gene variation explains why some people hate Brussels sprouts while others love them!",
        "level6": "TAS2R variation contributes to individual differences in bitter food preferences.",
        "level7": "Population-specific TAS2R pseudogenization patterns reflect local dietary selective pressures.",
        "level8": "TAS2R copy number and pseudogenization variation represents ongoing neutral evolution and dietary adaptation."
      },
      "ageEstimate": "Ongoing",
      "isActive": false,
      "functionKnown": "None (explains taste variation)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["taste", "evolution", "dietary-adaptation"]
    },
    {
      "id": "centromeric_alpha_sat",
      "name": "Centromeric Satellites",
      "type": "satellite",
      "subtype": "Alpha satellite",
      "chromosome": "1",
      "start": 122026460,
      "end": 125184587,
      "strand": ".",
      "nickname": "The Chromosome Holders",
      "color": "#84cc16",
      "icon": "Target",
      "shortDescription": {
        "level3": "Special repeating DNA that holds chromosomes together when cells divide.",
        "level4": "Highly repetitive DNA at chromosome centers essential for cell division.",
        "level5": "Alpha satellite DNA at centromeres that enables proper chromosome segregation during cell division.",
        "level6": "Centromeric alpha satellite arrays provide the foundation for kinetochore assembly.",
        "level7": "Alpha satellite higher-order repeats (HORs) establish centromere identity through CENP-A nucleosome positioning.",
        "level8": "Alpha satellite HOR arrays are essential for centromere function, kinetochore assembly, and accurate chromosome segregation."
      },
      "funFact": {
        "level3": "These are the parts that hold your chromosomes in the middle!",
        "level4": "Without this repeating DNA, your chromosomes would get lost when cells divide!",
        "level5": "Centromeric DNA is so repetitive that it was excluded from the 'completed' human genome until 2022!",
        "level6": "The T2T consortium finally sequenced centromeric regions in 2022, completing the human genome.",
        "level7": "Centromeric alpha satellites remained as gaps in GRCh38 until the T2T-CHM13 assembly.",
        "level8": "Complete centromeric sequence assembly required specialized long-read technologies due to repeat complexity."
      },
      "percentOfGenome": 3,
      "isActive": false,
      "functionKnown": "Essential for chromosome segregation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["centromere", "essential", "repetitive"]
    },
    {
      "id": "telomeric_repeats",
      "name": "Telomeric Repeats",
      "type": "satellite",
      "subtype": "Telomere",
      "chromosome": "1",
      "start": 1,
      "end": 10000,
      "strand": ".",
      "nickname": "The Chromosome Caps",
      "color": "#84cc16",
      "icon": "CircleDot",
      "shortDescription": {
        "level3": "Special caps on the ends of chromosomes, like the plastic tips on shoelaces.",
        "level4": "Protective repeating sequences at chromosome ends that prevent DNA damage.",
        "level5": "TTAGGG repeats at chromosome ends that protect DNA and shorten with each cell division.",
        "level6": "Telomeric repeats protect chromosome ends and shorten progressively, limiting replicative lifespan.",
        "level7": "Telomere attrition serves as a mitotic clock; critically short telomeres trigger senescence or apoptosis.",
        "level8": "Telomeric (TTAGGG)n arrays protect chromosome termini; progressive shortening underlies replicative senescence and is counteracted by telomerase in stem/cancer cells."
      },
      "funFact": {
        "level3": "These get shorter every time your cells divide - they're like a countdown clock!",
        "level4": "Your telomeres shorten as you age, which is why scientists study them in aging research.",
        "level5": "Telomere length is linked to aging - some jellyfish stay young by constantly rebuilding theirs!",
        "level6": "Telomere biology won the 2009 Nobel Prize and is central to cancer and aging research.",
        "level7": "Telomerase reactivation is a hallmark of cancer; telomere maintenance is essential for immortalization.",
        "level8": "Telomere biology bridges replicative senescence, stem cell function, aging, and oncogenesis."
      },
      "ageEstimate": "Ancient (conserved across eukaryotes)",
      "isActive": false,
      "functionKnown": "Essential for chromosome stability and aging",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["aging", "essential", "chromosome-ends"]
    },
    {
      "id": "alu_rna_editing",
      "name": "RNA Editing Alu",
      "type": "sine",
      "subtype": "Alu inverted",
      "chromosome": "3",
      "start": 128205860,
      "end": 128206460,
      "strand": "-",
      "nickname": "The Message Editor",
      "color": "#7c3aed",
      "icon": "Edit",
      "shortDescription": {
        "level3": "Alu pieces that let your cells edit messages in your RNA!",
        "level4": "Inverted Alu pairs that enable cells to change RNA messages after they're made.",
        "level5": "Alu elements in inverted orientation that create RNA structures subject to A-to-I editing.",
        "level6": "Inverted Alu pairs form dsRNA structures extensively edited by ADAR enzymes.",
        "level7": "Alu-derived dsRNA is the primary substrate for ADAR A-to-I editing in the human transcriptome.",
        "level8": "Primate-specific Alu-mediated A-to-I editing shapes the transcriptome and innate immune dsRNA recognition."
      },
      "funFact": {
        "level3": "Your cells can change the messages in RNA - Alu elements make this possible!",
        "level4": "More than 100 million spots in your RNA can be edited, mostly thanks to Alu elements!",
        "level5": "Humans have millions of A-to-I RNA editing sites, mostly in Alu - more than any other mammal!",
        "level6": "The human editome contains >100 million A-to-I sites, vastly exceeding other mammals.",
        "level7": "Alu-mediated expansion of the editome may contribute to human-specific neural complexity.",
        "level8": "Massive Alu-dependent editome expansion in primates may contribute to neural transcriptome complexity and cognitive evolution."
      },
      "isActive": false,
      "functionKnown": "Enables RNA editing (A-to-I)",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["rna-editing", "innovation", "primate-specific"]
    },
    {
      "id": "segdup_smn",
      "name": "SMN Segmental Duplication",
      "type": "segmental_duplication",
      "subtype": "Interchromosomal",
      "chromosome": "5",
      "start": 70220768,
      "end": 70950000,
      "strand": ".",
      "nickname": "The Backup Gene Copy",
      "color": "#0ea5e9",
      "icon": "CopyPlus",
      "shortDescription": {
        "level3": "An extra backup copy of an important gene that can help if the main one breaks.",
        "level4": "A duplicated region containing SMN genes - having backups can protect against disease.",
        "level5": "The SMN1/SMN2 duplication where SMN2 copy number modifies spinal muscular atrophy severity.",
        "level6": "Segmental duplication created SMN1/SMN2; SMN2 copy number is a key SMA severity modifier.",
        "level7": "SMN2's partial functional redundancy with SMN1 underlies SMA pathogenesis and antisense oligo therapy rationale.",
        "level8": "The SMN1/SMN2 segmental duplication illustrates how paralog redundancy modifies disease phenotypes and enables novel therapeutic strategies."
      },
      "funFact": {
        "level3": "The backup copy (SMN2) is why gene therapy for SMA works!",
        "level4": "Doctors can now use the backup SMN2 gene to help treat spinal muscular atrophy!",
        "level5": "SMN2 copy number varies between people and directly affects SMA disease severity.",
        "level6": "SMN2-targeted therapies (nusinersen, risdiplam) exploit this segmental duplication for treatment.",
        "level7": "The SMN locus exemplifies translational genomics: understanding duplication biology enabled therapy.",
        "level8": "SMN2-directed therapeutics (splice modulators, gene replacement) represent precision medicine enabled by segmental duplication biology."
      },
      "ageEstimate": "~5 million years",
      "isActive": false,
      "functionKnown": "SMN2 modifies SMA disease severity",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["disease-modifier", "therapy-target", "duplication"]
    },
    {
      "id": "numt_chr1_large",
      "name": "Chromosome 1 NUMT",
      "type": "numt",
      "subtype": "Large NUMT",
      "chromosome": "1",
      "start": 564465,
      "end": 569465,
      "strand": "+",
      "nickname": "Mitochondrial Refugee",
      "color": "#14b8a6",
      "icon": "Zap",
      "shortDescription": {
        "level3": "A piece of your mitochondria's DNA that escaped into your main chromosomes!",
        "level4": "Mitochondrial DNA that jumped into chromosome 1 - like a refugee finding a new home.",
        "level5": "A ~5kb mitochondrial DNA segment that transferred to nuclear chromosome 1.",
        "level6": "A large NUMT representing near-complete mitochondrial genome transfer to chromosome 1.",
        "level7": "This NUMT contains multiple mitochondrial gene fragments including portions of ND genes and tRNAs.",
        "level8": "This ~5kb NUMT represents a single integration event capturing a substantial mtDNA segment with degraded but recognizable gene sequences."
      },
      "funFact": {
        "level3": "Your mitochondria have their own DNA, and sometimes pieces escape!",
        "level4": "This DNA used to be in tiny power stations in your cells, then it moved to a chromosome!",
        "level5": "NUMTs are like molecular fossils showing how mitochondrial DNA transfers to the nucleus over time.",
        "level6": "NUMTs can complicate forensic mtDNA analysis when they're accidentally amplified instead of true mtDNA.",
        "level7": "NUMT insertions provide dated molecular fossils of mtDNA sequence evolution.",
        "level8": "NUMTs serve as paleogenomic records, preserving ancestral mtDNA sequences at their time of integration."
      },
      "ageEstimate": "~3 million years",
      "isActive": false,
      "functionKnown": "None (provides evolutionary record)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["mitochondria", "dna-transfer", "molecular-fossil"]
    },
    {
      "id": "numt_chr5_recent",
      "name": "Recent NUMT",
      "type": "numt",
      "subtype": "Recent insertion",
      "chromosome": "5",
      "start": 130911350,
      "end": 130911900,
      "strand": "-",
      "nickname": "The Fresh Escapee",
      "color": "#14b8a6",
      "icon": "Zap",
      "shortDescription": {
        "level3": "A new piece of mitochondria DNA that just recently jumped into your chromosomes!",
        "level4": "A recent mitochondrial DNA transfer - so new that some people have it and others don't!",
        "level5": "A polymorphic NUMT present in some human populations but not others, indicating recent integration.",
        "level6": "A polymorphic NUMT insertion showing ongoing mitochondrial-to-nuclear DNA transfer in humans.",
        "level7": "This NUMT is polymorphic in human populations, demonstrating active mitochondrial DNA transfer.",
        "level8": "Polymorphic NUMTs like this demonstrate ongoing organellar-nuclear genome integration, estimated at ~5 events per million years."
      },
      "funFact": {
        "level3": "Some people have this DNA and some don't - it's that new!",
        "level4": "DNA is still jumping from mitochondria to chromosomes even today!",
        "level5": "About 5 new NUMTs appear in human lineages every million years - evolution in action!",
        "level6": "Polymorphic NUMTs demonstrate that mitochondrial-nuclear transfer is an ongoing evolutionary process.",
        "level7": "NUMT polymorphism across populations provides insights into human demographic history.",
        "level8": "Population-specific NUMT presence/absence patterns can serve as phylogenetic markers for human migration studies."
      },
      "ageEstimate": "<100,000 years",
      "isActive": false,
      "functionKnown": "None",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["recent", "polymorphic", "ongoing-evolution"]
    },
    {
      "id": "numt_forensic",
      "name": "Forensic NUMT",
      "type": "numt",
      "subtype": "D-loop NUMT",
      "chromosome": "11",
      "start": 67020000,
      "end": 67021200,
      "strand": "+",
      "nickname": "The Forensic Trickster",
      "color": "#14b8a6",
      "icon": "Search",
      "shortDescription": {
        "level3": "A copycat DNA that can confuse scientists trying to solve crimes!",
        "level4": "A nuclear copy of mitochondrial DNA that can cause mix-ups in forensic investigations.",
        "level5": "A NUMT containing D-loop sequences that can interfere with forensic mitochondrial DNA analysis.",
        "level6": "This D-loop NUMT can produce spurious results when standard mtDNA forensic primers are used.",
        "level7": "D-loop-containing NUMTs are particularly problematic for forensic mtDNA typing due to primer cross-reactivity.",
        "level8": "Forensically problematic NUMTs necessitate careful primer design and sequence verification in mtDNA-based identification."
      },
      "funFact": {
        "level3": "This DNA can trick forensic scientists because it looks like mitochondrial DNA!",
        "level4": "Crime labs have to be careful not to accidentally test this instead of real mitochondrial DNA!",
        "level5": "NUMTs have actually caused confusion in some criminal investigations before scientists knew to look for them!",
        "level6": "Several forensic cases have required re-analysis after NUMT co-amplification was discovered.",
        "level7": "NUMT awareness is now standard in forensic mtDNA analysis protocols.",
        "level8": "NUMT contamination led to the development of specialized forensic protocols including whole mtGenome sequencing."
      },
      "isActive": false,
      "functionKnown": "None (forensic concern)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["forensics", "medical-relevance", "d-loop"]
    },
    {
      "id": "gene_desert_chr5",
      "name": "Chromosome 5 Desert",
      "type": "gene_desert",
      "subtype": "Regulatory desert",
      "chromosome": "5",
      "start": 24400000,
      "end": 29200000,
      "strand": ".",
      "nickname": "The Mysterious Empty Zone",
      "color": "#fbbf24",
      "icon": "MapPin",
      "shortDescription": {
        "level3": "A huge empty stretch of DNA with no genes at all - almost 5 million letters of mystery!",
        "level4": "One of the largest gene-free regions in the human genome, spanning almost 5 million base pairs.",
        "level5": "A 4.8 Mb gene desert on chromosome 5 - one of the largest in the human genome.",
        "level6": "This gene desert contains conserved non-coding elements suggesting regulatory function.",
        "level7": "Large gene deserts often harbor enhancers controlling distant developmental genes.",
        "level8": "This gene desert contains multiple highly conserved non-coding elements with putative long-range enhancer activity."
      },
      "funFact": {
        "level3": "Even though there are no genes here, this DNA is kept almost the same across animals!",
        "level4": "Scientists thought empty DNA would change randomly, but this region stays the same - why?",
        "level5": "Gene deserts often contain hidden control switches for genes that are millions of bases away!",
        "level6": "Conservation in gene deserts suggests important regulatory functions yet to be discovered.",
        "level7": "Many disease-associated variants map to gene deserts, implicating long-range regulatory effects.",
        "level8": "GWAS hits in gene deserts often involve enhancers with complex 3D chromatin interactions to distant promoters."
      },
      "isActive": false,
      "functionKnown": "Possible long-range regulatory region",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["mysterious", "conserved", "regulatory"]
    },
    {
      "id": "gene_desert_chr13_pax",
      "name": "PAX6 Regulatory Desert",
      "type": "gene_desert",
      "subtype": "Developmental desert",
      "chromosome": "11",
      "start": 31000000,
      "end": 33500000,
      "strand": ".",
      "nickname": "The Eye Control Desert",
      "color": "#fbbf24",
      "icon": "Eye",
      "shortDescription": {
        "level3": "An empty DNA region that controls how your eyes grow!",
        "level4": "A gene-free zone that contains invisible switches controlling eye development.",
        "level5": "A gene desert containing enhancers that control PAX6, a master gene for eye development.",
        "level6": "This gene desert harbors long-range enhancers for PAX6, mutations in which cause aniridia.",
        "level7": "PAX6 enhancer mutations in this desert cause position effect aniridia despite leaving PAX6 intact.",
        "level8": "This locus demonstrates how gene desert deletions can cause haploinsufficiency phenotypes through enhancer disruption (position effects)."
      },
      "funFact": {
        "level3": "Deleting this 'empty' DNA can cause people to be born without irises!",
        "level4": "Even though there are no genes here, losing it can affect your eyes!",
        "level5": "Some people missing this 'empty' region are born with eye problems, proving it's not really empty!",
        "level6": "Aniridia (missing iris) can result from deletions in this 'empty' region, not just PAX6 itself.",
        "level7": "Position effect mutations in gene deserts expanded our understanding of long-range gene regulation.",
        "level8": "PAX6 regulatory mutations provided early evidence for megabase-scale enhancer-promoter interactions in humans."
      },
      "isActive": false,
      "functionKnown": "Controls PAX6 expression for eye development",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["eye-development", "enhancers", "position-effect"]
    },
    {
      "id": "gene_desert_shh",
      "name": "SHH Regulatory Desert",
      "type": "gene_desert",
      "subtype": "Limb control region",
      "chromosome": "7",
      "start": 155250000,
      "end": 156500000,
      "strand": ".",
      "nickname": "The Limb Blueprint Zone",
      "color": "#fbbf24",
      "icon": "Hand",
      "shortDescription": {
        "level3": "Empty DNA that tells your body how to grow fingers and toes!",
        "level4": "A gene desert containing the famous ZRS enhancer that controls limb development.",
        "level5": "This region contains the ZRS (Zone of Polarizing Activity Regulatory Sequence), controlling digit patterning.",
        "level6": "The ZRS enhancer in this desert controls SHH expression in limbs; mutations cause polydactyly.",
        "level7": "ZRS point mutations cause preaxial polydactyly; the enhancer is ~1 Mb from SHH.",
        "level8": "The ZRS demonstrates megabase-scale enhancer-promoter communication, with point mutations causing various polydactyly phenotypes."
      },
      "funFact": {
        "level3": "Changes in this 'empty' region can give people extra fingers or toes!",
        "level4": "One tiny change in this region - far from any gene - can make you grow extra fingers!",
        "level5": "The ZRS enhancer is 1 million bases away from the gene it controls - talk about long-distance relationship!",
        "level6": "Ernest Hemingway's famous six-toed cats likely have ZRS mutations.",
        "level7": "ZRS mutations in snakes may have contributed to limb loss during evolution.",
        "level8": "Comparative ZRS analysis in snakes reveals sequence degeneration correlating with limb reduction."
      },
      "ageEstimate": "Enhancer conserved for >400 million years",
      "isActive": false,
      "functionKnown": "Controls limb digit development via SHH",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["limb-development", "polydactyly", "famous-enhancer"]
    },
    {
      "id": "har1",
      "name": "HAR1",
      "type": "har",
      "subtype": "RNA gene",
      "chromosome": "20",
      "start": 63102250,
      "end": 63102368,
      "strand": "-",
      "nickname": "The Human Brain Accelerator",
      "color": "#f59e0b",
      "icon": "Brain",
      "shortDescription": {
        "level3": "The part of DNA that changed the most since we split from chimps - in our brains!",
        "level4": "The fastest-evolving region in human DNA, active during brain development.",
        "level5": "The most rapidly evolving sequence in humans, encoding an RNA expressed in developing brain.",
        "level6": "HAR1 encodes a non-coding RNA expressed in Cajal-Retzius neurons during cortical development.",
        "level7": "HAR1F accumulated 18 human-specific substitutions vs 2 between chimp and chicken over 310MY.",
        "level8": "HAR1 shows unprecedented acceleration (18 substitutions vs expected 0.27), with functional implications for neocortical development."
      },
      "funFact": {
        "level3": "This tiny bit of DNA changed more in humans than it did between chickens and chimps!",
        "level4": "In 310 million years between chicken and chimp, only 2 changes. In 6 million years in humans, 18 changes!",
        "level5": "HAR1 was virtually frozen for hundreds of millions of years, then suddenly evolved rapidly only in humans!",
        "level6": "The statistical probability of this acceleration by chance is essentially zero.",
        "level7": "HAR1 represents the most extreme example of lineage-specific acceleration in the human genome.",
        "level8": "HAR1 evolution likely involved positive selection, possibly related to brain size or complexity expansion."
      },
      "ageEstimate": "Human-specific changes: ~6 million years",
      "isActive": false,
      "functionKnown": "Expressed during brain development",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["brain", "human-specific", "fastest-evolving"]
    },
    {
      "id": "har2",
      "name": "HAR2 (HACNS1)",
      "type": "har",
      "subtype": "Limb enhancer",
      "chromosome": "2",
      "start": 236773656,
      "end": 236774546,
      "strand": ".",
      "nickname": "The Thumb Enhancer",
      "color": "#f59e0b",
      "icon": "Hand",
      "shortDescription": {
        "level3": "Super-evolved DNA that might help explain our amazing thumbs!",
        "level4": "A rapidly changed region that may have helped humans develop our precise hand grip.",
        "level5": "A human-accelerated enhancer active in developing limbs, potentially related to hand dexterity.",
        "level6": "HACNS1 gained human-specific enhancer activity in the developing limb, particularly the thumb.",
        "level7": "Human-specific substitutions in HACNS1 created novel enhancer activity in the presumptive thumb region.",
        "level8": "HACNS1 demonstrates acquisition of novel cis-regulatory activity through accumulated human-specific substitutions."
      },
      "funFact": {
        "level3": "This might be part of why humans have such amazing thumbs!",
        "level4": "When scientists put the human version in mice, it lit up where the thumb develops!",
        "level5": "The human HAR2 sequence activates gene expression in developing thumbs - the chimp version doesn't!",
        "level6": "Transgenic assays show human-specific HACNS1 activity in the anterior limb bud.",
        "level7": "HACNS1 exemplifies how non-coding changes can drive morphological evolution.",
        "level8": "HACNS1 is a paradigm for human trait evolution through enhancer modification rather than protein change."
      },
      "ageEstimate": "Human-specific changes: ~6 million years",
      "isActive": false,
      "functionKnown": "May contribute to human hand/thumb development",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["hand", "human-specific", "enhancer"]
    },
    {
      "id": "har_foxp2",
      "name": "FOXP2 HAR",
      "type": "har",
      "subtype": "Language-associated",
      "chromosome": "7",
      "start": 114086327,
      "end": 114693772,
      "strand": ".",
      "nickname": "The Language Gene Region",
      "color": "#f59e0b",
      "icon": "MessageCircle",
      "shortDescription": {
        "level3": "A region near the gene that helps humans talk and use language!",
        "level4": "An accelerated region near FOXP2, the gene important for human speech and language.",
        "level5": "A HAR near FOXP2, the gene whose mutation causes speech and language disorders.",
        "level6": "Human-accelerated sequences in the FOXP2 region may have contributed to language evolution.",
        "level7": "FOXP2 shows two human-specific amino acid changes fixed since the human-Neanderthal split.",
        "level8": "The FOXP2 locus contains both coding changes and HARs, representing a complex target of human evolution."
      },
      "funFact": {
        "level3": "Mutations in the nearby gene FOXP2 can make it hard to talk!",
        "level4": "The FOXP2 gene is sometimes called 'the language gene' - and this region evolved fast in humans!",
        "level5": "The FOXP2 gene is one of the few genes with human-specific changes that Neanderthals also had!",
        "level6": "Neanderthals shared human FOXP2 variants, suggesting language-related selection predates modern humans.",
        "level7": "FOXP2 underwent a selective sweep ~200,000 years ago in the human lineage.",
        "level8": "Integrating coding and regulatory evolution at FOXP2 remains an active area in human evolution research."
      },
      "ageEstimate": "~200,000 years for the selective sweep",
      "isActive": false,
      "functionKnown": "Possibly contributes to language ability",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["language", "speech", "human-specific"]
    },
    {
      "id": "neanderthal_oas",
      "name": "Neanderthal Immune Region",
      "type": "neanderthal",
      "subtype": "Adaptive introgression",
      "chromosome": "12",
      "start": 113344739,
      "end": 113450067,
      "strand": ".",
      "nickname": "The Neanderthal Shield",
      "color": "#8b5cf6",
      "icon": "Shield",
      "shortDescription": {
        "level3": "DNA from Neanderthals that helps protect us from germs!",
        "level4": "Neanderthal DNA that we kept because it helps our immune system fight infections.",
        "level5": "Neanderthal-derived immune genes under positive selection, boosting pathogen defense.",
        "level6": "OAS gene cluster variants from Neanderthals show signatures of adaptive introgression.",
        "level7": "The OAS1-OAS3 region contains high-frequency Neanderthal haplotypes with enhanced antiviral function.",
        "level8": "OAS gene introgression from Neanderthals provides ~2-fold enhanced interferon-induced antiviral response."
      },
      "funFact": {
        "level3": "Neanderthal DNA helped our ancestors survive new diseases when they came to Europe!",
        "level4": "About half of Europeans carry this helpful Neanderthal immune DNA!",
        "level5": "Neanderthals had lived in Europe for 200,000+ years and adapted to local diseases - we inherited their protection!",
        "level6": "Adaptive introgression let humans quickly acquire locally-adapted immune variants.",
        "level7": "Multiple toll-like receptor variants from Neanderthals show similar adaptive introgression patterns.",
        "level8": "Immune gene introgression represents the clearest case of adaptive Neanderthal DNA in modern humans."
      },
      "ageEstimate": "Introgressed ~50,000-60,000 years ago",
      "isActive": false,
      "functionKnown": "Enhanced antiviral immune response",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["immune", "adaptive", "helpful-DNA"]
    },
    {
      "id": "neanderthal_skin_hair",
      "name": "Neanderthal Skin/Hair Region",
      "type": "neanderthal",
      "subtype": "Adaptive introgression",
      "chromosome": "2",
      "start": 136608646,
      "end": 136676490,
      "strand": "+",
      "nickname": "The Caveman Coat",
      "color": "#8b5cf6",
      "icon": "Sun",
      "shortDescription": {
        "level3": "Neanderthal DNA that affected skin and hair to help survive cold, dark Europe!",
        "level4": "DNA from Neanderthals that changed skin and hair features for living in Europe's climate.",
        "level5": "Introgressed Neanderthal variants affecting skin pigmentation and hair characteristics.",
        "level6": "This region contains BNC2 variants from Neanderthals associated with skin pigmentation.",
        "level7": "Neanderthal BNC2 haplotypes show frequency clines correlated with latitude in Europeans.",
        "level8": "BNC2 introgression demonstrates adaptive phenotypic effects of Neanderthal ancestry on skin saturation and freckling."
      },
      "funFact": {
        "level3": "Some of your skin and hair genes might come from Neanderthals!",
        "level4": "Neanderthal DNA affects freckles, skin color, and even how easily you tan!",
        "level5": "70% of Europeans carry Neanderthal variants affecting skin saturation!",
        "level6": "Neanderthal skin/hair variants helped modern humans adapt to reduced UV in higher latitudes.",
        "level7": "Multiple skin-related loci show evidence of adaptive introgression from Neanderthals.",
        "level8": "Skin pigmentation genes represent the largest category of phenotype-associated Neanderthal variants in Europeans."
      },
      "ageEstimate": "Introgressed ~50,000-60,000 years ago",
      "isActive": false,
      "functionKnown": "Affects skin pigmentation and hair characteristics",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["skin", "hair", "adaptation", "europe"]
    },
    {
      "id": "neanderthal_desert",
      "name": "Neanderthal DNA Desert",
      "type": "neanderthal",
      "subtype": "Introgression desert",
      "chromosome": "7",
      "start": 1,
      "end": 5000000,
      "strand": ".",
      "nickname": "The Forbidden Zone",
      "color": "#8b5cf6",
      "icon": "Ban",
      "shortDescription": {
        "level3": "A place where Neanderthal DNA was removed because it caused problems!",
        "level4": "A region where Neanderthal DNA was harmful and got eliminated over time.",
        "level5": "A region depleted of Neanderthal ancestry due to negative selection against hybrid incompatibilities.",
        "level6": "Introgression deserts mark regions where Neanderthal DNA reduced fitness in hybrids.",
        "level7": "This region shows significant depletion of Neanderthal ancestry consistent with hybrid incompatibility.",
        "level8": "Neanderthal introgression deserts often contain genes for male fertility and brain development, suggesting reproductive and cognitive incompatibilities."
      },
      "funFact": {
        "level3": "Some Neanderthal DNA was bad for human-Neanderthal babies, so it disappeared!",
        "level4": "Neanderthal DNA near genes for thinking and having babies was mostly removed!",
        "level5": "The X chromosome has very little Neanderthal DNA - hybrid males may have been less fertile!",
        "level6": "Introgression deserts suggest partial reproductive isolation between humans and Neanderthals.",
        "level7": "X chromosome depletion follows Haldane's rule predictions for male hybrid dysfunction.",
        "level8": "Introgression desert distribution supports classical hybrid incompatibility theory with X chromosome and spermatogenesis effects."
      },
      "ageEstimate": "Selection occurring for ~50,000 years",
      "isActive": false,
      "functionKnown": "None (marks hybrid incompatibility)",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["incompatibility", "selection", "hybrid"]
    },
    {
      "id": "neanderthal_covid",
      "name": "Neanderthal COVID Risk Region",
      "type": "neanderthal",
      "subtype": "Disease risk",
      "chromosome": "3",
      "start": 45859651,
      "end": 45909024,
      "strand": ".",
      "nickname": "The Ancient Risk Factor",
      "color": "#8b5cf6",
      "icon": "AlertTriangle",
      "shortDescription": {
        "level3": "Neanderthal DNA that makes COVID-19 more dangerous for some people!",
        "level4": "A Neanderthal DNA region that increases the risk of severe COVID-19 illness.",
        "level5": "A Neanderthal haplotype associated with approximately 2x increased risk of severe COVID-19.",
        "level6": "This introgressed Neanderthal haplotype is the major genetic risk factor for severe COVID-19.",
        "level7": "The ~50kb Neanderthal haplotype near LZTFL1 doubles COVID-19 hospitalization risk.",
        "level8": "This chr3 Neanderthal haplotype's COVID-19 risk association was among the first GWAS hits for severe disease."
      },
      "funFact": {
        "level3": "DNA we got from Neanderthals 50,000 years ago affected COVID-19 in 2020!",
        "level4": "About 16% of Europeans carry this COVID risk DNA from Neanderthals!",
        "level5": "This harmful Neanderthal DNA is common in South Asia (50%) but rare in Africa (0%) and East Asia (4%)!",
        "level6": "The geographic distribution likely reflects different human migration routes and population history.",
        "level7": "This locus demonstrates how archaic introgression can have major effects on modern disease susceptibility.",
        "level8": "This finding highlights how ancestral variants face novel selective pressures from emerging pathogens."
      },
      "ageEstimate": "Introgressed ~50,000-60,000 years ago",
      "isActive": false,
      "functionKnown": "Major genetic risk factor for severe COVID-19",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["covid", "disease-risk", "modern-relevance"]
    },
    {
      "id": "neanderthal_protective_covid",
      "name": "Neanderthal COVID Protection",
      "type": "neanderthal",
      "subtype": "Disease protection",
      "chromosome": "12",
      "start": 113350796,
      "end": 113425679,
      "strand": ".",
      "nickname": "The Ancient Shield",
      "color": "#8b5cf6",
      "icon": "ShieldCheck",
      "shortDescription": {
        "level3": "Different Neanderthal DNA that actually protects against severe COVID-19!",
        "level4": "A protective Neanderthal region - proof that some Neanderthal DNA helps us!",
        "level5": "A Neanderthal haplotype at OAS genes that reduces COVID-19 severity by about 22%.",
        "level6": "This Neanderthal OAS haplotype provides protection against severe COVID-19 outcomes.",
        "level7": "The protective effect involves enhanced OAS1 enzyme activity against SARS-CoV-2.",
        "level8": "This protective haplotype contains a splice variant producing a more active OAS1 isoform against coronaviruses."
      },
      "funFact": {
        "level3": "Some Neanderthal DNA makes COVID worse, but this DNA makes it better!",
        "level4": "About half of people outside Africa carry this helpful Neanderthal COVID protection!",
        "level5": "The same Neanderthals gave us both COVID risk AND COVID protection - in different DNA regions!",
        "level6": "Neanderthal introgression's health effects are complex - both harmful and beneficial variants exist.",
        "level7": "The opposing COVID effects of different Neanderthal haplotypes illustrate introgression's complexity.",
        "level8": "These contrasting COVID associations demonstrate context-dependent effects of archaic introgression on modern phenotypes."
      },
      "ageEstimate": "Introgressed ~50,000-60,000 years ago",
      "isActive": false,
      "functionKnown": "Protective against severe COVID-19",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["covid", "protective", "helpful-DNA"]
    },
    {
      "id": "neanderthal_pain",
      "name": "Neanderthal Pain Sensitivity",
      "type": "neanderthal",
      "subtype": "Sensory",
      "chromosome": "2",
      "start": 166849158,
      "end": 166930147,
      "strand": "-",
      "nickname": "The Neanderthal Ouch Gene",
      "color": "#8b5cf6",
      "icon": "Activity",
      "shortDescription": {
        "level3": "Neanderthal DNA that makes some people feel more pain!",
        "level4": "A Neanderthal gene variant that affects how sensitive people are to pain.",
        "level5": "A Neanderthal SCN9A variant associated with increased pain sensitivity in carriers.",
        "level6": "The Neanderthal SCN9A haplotype affects sodium channel function and pain perception.",
        "level7": "Neanderthal SCN9A variants lower the activation threshold for pain-sensing neurons.",
        "level8": "The introgressed SCN9A variants alter Nav1.7 channel gating, increasing nociceptor excitability."
      },
      "funFact": {
        "level3": "Some people feel more pain because of DNA they got from Neanderthals!",
        "level4": "About 0.4% of British people carry this Neanderthal pain gene!",
        "level5": "Neanderthals may have been more pain-sensitive than modern humans!",
        "level6": "This represents a rare case of Neanderthal DNA having detrimental phenotypic effects.",
        "level7": "The pain-related Neanderthal haplotype is at low frequency, consistent with negative selection.",
        "level8": "Low frequency of this haplotype suggests ongoing purifying selection against the pain-sensitizing alleles."
      },
      "ageEstimate": "Introgressed ~50,000-60,000 years ago",
      "isActive": false,
      "functionKnown": "Increases pain sensitivity",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["pain", "sensory", "low-frequency"]
    },
    {
      "id": "chr2_fusion",
      "name": "Chromosome 2 Fusion Site",
      "type": "fusion",
      "subtype": "Chromosomal fusion",
      "chromosome": "2",
      "start": 113769155,
      "end": 114123882,
      "strand": ".",
      "nickname": "The Ape Merger",
      "color": "#e11d48",
      "icon": "GitMerge",
      "shortDescription": {
        "level3": "The spot where two ape chromosomes stuck together to make human chromosome 2!",
        "level4": "Where two separate chromosomes from our ape ancestors fused together millions of years ago.",
        "level5": "The fusion point of ancestral chromosomes 2A and 2B, explaining why humans have 46 chromosomes while great apes have 48.",
        "level6": "Telomere-to-telomere fusion site containing remnant telomeric sequences, proving human chromosome 2 arose from fusion.",
        "level7": "Contains head-to-head telomeric repeats (TTAGGG)n and a vestigial centromere, definitively establishing the fusion origin.",
        "level8": "The 2q13-2q14.1 fusion site contains degenerate telomeric arrays in head-to-head orientation plus an inactive centromere at 2q21, providing unequivocal evidence of chromosomal fusion."
      },
      "funFact": {
        "level3": "This is the proof that humans evolved from apes - you can see where two chromosomes stuck together!",
        "level4": "Great apes like chimps have 48 chromosomes, we have 46. This fusion is why!",
        "level5": "You can still see the old telomeres (chromosome end caps) stuck in the middle of chromosome 2!",
        "level6": "The vestigial telomeres and inactive centromere are 'smoking gun' evidence for human-ape common ancestry.",
        "level7": "This fusion event occurred ~4-5 million years ago in the human lineage after divergence from chimpanzees.",
        "level8": "The fusion junction contains ~800 degenerate TTAGGG repeats in head-to-head arrangement, plus a recognizable but inactivated ancestral centromere."
      },
      "ageEstimate": "~4-5 million years",
      "isActive": false,
      "functionKnown": "None (evolutionary landmark)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "human-specific", "chromosomal-fusion", "famous"]
    },
    {
      "id": "chr2_vestigial_centromere",
      "name": "Vestigial Centromere",
      "type": "fusion",
      "subtype": "Inactive centromere",
      "chromosome": "2",
      "start": 91800000,
      "end": 92200000,
      "strand": ".",
      "nickname": "The Ghost Centromere",
      "color": "#e11d48",
      "icon": "Ghost",
      "shortDescription": {
        "level3": "An old chromosome center that doesn't work anymore!",
        "level4": "The leftover centromere from one of the ape chromosomes that fused to make human chromosome 2.",
        "level5": "An inactive centromere from ancestral chromosome 2B, silenced after the fusion event.",
        "level6": "Vestigial alphoid sequences from the ancestral 2B centromere, now epigenetically silenced.",
        "level7": "Contains degraded alpha satellite arrays lacking CENP-A deposition, rendering it non-functional.",
        "level8": "The 2q21 vestigial centromere retains recognizable alphoid sequences but lacks centromeric chromatin marks (CENP-A, H3K4me2)."
      },
      "funFact": {
        "level3": "Every chromosome needs a center (centromere) - but chromosome 2 has TWO, and one is broken!",
        "level4": "When the chromosomes fused, one centromere had to be turned off or the chromosome wouldn't work!",
        "level5": "Having two active centromeres would cause the chromosome to be torn apart during cell division!",
        "level6": "Dicentric chromosomes are unstable; one centromere had to be inactivated for the fusion to succeed.",
        "level7": "Centromere inactivation likely occurred through epigenetic silencing rather than sequence deletion.",
        "level8": "The rapid centromere inactivation following fusion demonstrates the genome's ability to epigenetically resolve dicentric instability."
      },
      "ageEstimate": "~4-5 million years",
      "isActive": false,
      "functionKnown": "None (inactivated)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["evolution", "centromere", "chromosomal-fusion"]
    },
    {
      "id": "denisovan_immune",
      "name": "Denisovan Immune Genes",
      "type": "denisovan",
      "subtype": "Adaptive introgression",
      "chromosome": "6",
      "start": 29722775,
      "end": 33089696,
      "strand": ".",
      "nickname": "The Mystery Human's Gift",
      "color": "#0891b2",
      "icon": "Shield",
      "shortDescription": {
        "level3": "DNA from mysterious ancient humans called Denisovans that helps our immune system!",
        "level4": "Immune genes inherited from Denisovans, an ancient human species known only from a few bones.",
        "level5": "HLA variants inherited from Denisovans that provide enhanced immune diversity and pathogen resistance.",
        "level6": "Denisovan-derived HLA haplotypes contributing to adaptive immunity in Asian and Oceanian populations.",
        "level7": "HLA-A, HLA-B, and HLA-C alleles introgressed from Denisovans showing evidence of positive selection.",
        "level8": "Archaic HLA introgression from Denisovans contributes >50% of HLA-B alleles in some Melanesian populations."
      },
      "funFact": {
        "level3": "We only know Denisovans from a finger bone and teeth, but their DNA lives on in billions of people!",
        "level4": "Denisovans were discovered in 2010 from DNA in a tiny finger bone found in a Siberian cave!",
        "level5": "Up to 6% of Melanesian and Aboriginal Australian DNA comes from Denisovans!",
        "level6": "Denisovan DNA is most common in people from Papua New Guinea and Australia.",
        "level7": "Multiple Denisovan introgression events may have occurred at different times and locations.",
        "level8": "Population genetics suggests at least two distinct Denisovan admixture events into different modern human populations."
      },
      "ageEstimate": "Introgressed ~45,000-55,000 years ago",
      "isActive": false,
      "functionKnown": "Enhanced immune diversity",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["denisovan", "immune", "adaptive", "oceania"]
    },
    {
      "id": "denisovan_altitude",
      "name": "Denisovan Altitude Adaptation",
      "type": "denisovan",
      "subtype": "Adaptive introgression",
      "chromosome": "2",
      "start": 46441930,
      "end": 46613842,
      "strand": "+",
      "nickname": "The Mountain Climber Gene",
      "color": "#0891b2",
      "icon": "Mountain",
      "shortDescription": {
        "level3": "Denisovan DNA that helps Tibetans breathe at super high mountains!",
        "level4": "A gene from Denisovans that helps Tibetan people survive at high altitudes where there's less oxygen.",
        "level5": "The EPAS1 gene variant from Denisovans that allows Tibetans to thrive at altitudes above 4,000 meters.",
        "level6": "Denisovan-derived EPAS1 haplotype providing blunted hypoxic response and high-altitude adaptation.",
        "level7": "The EPAS1 Tibetan haplotype shows highest archaic match to Denisovans, demonstrating adaptive introgression for altitude.",
        "level8": "EPAS1 introgression from Denisovans represents one of the clearest examples of adaptive archaic alleles in modern humans."
      },
      "funFact": {
        "level3": "Without this Denisovan DNA, Tibetans couldn't live on their super-high plateau!",
        "level4": "This gene helps Tibetans survive where others get mountain sickness!",
        "level5": "87% of Tibetans carry this Denisovan variant, but it's rare everywhere else!",
        "level6": "This is the strongest signal of adaptive introgression in humans - incredibly rare except in Tibet.",
        "level7": "The EPAS1 introgression allowed rapid high-altitude adaptation without waiting for new mutations.",
        "level8": "EPAS1 adaptive introgression shows how archaic DNA enabled human colonization of extreme environments."
      },
      "ageEstimate": "Introgressed ~40,000+ years ago",
      "isActive": false,
      "functionKnown": "High-altitude adaptation",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["denisovan", "tibet", "adaptation", "famous", "altitude"]
    },
    {
      "id": "denisovan_fat",
      "name": "Denisovan Fat Metabolism",
      "type": "denisovan",
      "subtype": "Adaptive introgression",
      "chromosome": "11",
      "start": 61547465,
      "end": 61653823,
      "strand": "+",
      "nickname": "The Arctic Diet Gene",
      "color": "#0891b2",
      "icon": "Snowflake",
      "shortDescription": {
        "level3": "Denisovan DNA that helps some people eat lots of fat without getting sick!",
        "level4": "A gene variant from Denisovans that helps Inuit people digest their traditional high-fat diet.",
        "level5": "FADS gene variants from Denisovans that improve omega-3 fatty acid metabolism.",
        "level6": "Denisovan-derived FADS cluster variants selected in populations with marine-based diets.",
        "level7": "Introgressed FADS haplotypes show strong selection signals in Greenlandic Inuit and other Arctic populations.",
        "level8": "FADS introgression demonstrates how archaic alleles facilitated metabolic adaptation to Arctic diets rich in marine lipids."
      },
      "funFact": {
        "level3": "Inuit people can eat whale blubber and seal fat thanks to ancient DNA!",
        "level4": "Arctic peoples adapted to eating almost nothing but fatty meat and fish!",
        "level5": "These variants help convert omega fatty acids, crucial for a diet of seals and whales!",
        "level6": "Selection for these variants is among the strongest signals in the human genome.",
        "level7": "Multiple archaic introgression events contributed to fatty acid metabolism adaptation.",
        "level8": "FADS adaptive introgression illustrates the complex interplay between archaic admixture, diet, and natural selection."
      },
      "ageEstimate": "Introgressed ~40,000+ years ago",
      "isActive": false,
      "functionKnown": "Lipid metabolism adaptation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["denisovan", "inuit", "adaptation", "diet"]
    },
    {
      "id": "denisovan_sulawesi",
      "name": "Denisovan DNA in Sulawesi",
      "type": "denisovan",
      "subtype": "Population signature",
      "chromosome": "3",
      "start": 115000000,
      "end": 118000000,
      "strand": ".",
      "nickname": "Island Denisovan Legacy",
      "color": "#0891b2",
      "icon": "Palmtree",
      "shortDescription": {
        "level3": "Special Denisovan DNA only found in people from certain Indonesian islands!",
        "level4": "Unique Denisovan ancestry found in people from the Philippines and Indonesia.",
        "level5": "A distinct Denisovan population's DNA found only in Philippine Negrito and some Indonesian groups.",
        "level6": "Evidence for a 'southern Denisovan' population distinct from the Siberian Denisovan genome.",
        "level7": "Philippine Ayta Magbukon carry highest levels of Denisovan ancestry (~5%) from a distinct source population.",
        "level8": "Population genetics reveals multiple Denisovan lineages, with 'Denisovan 2' contributing specifically to Philippine/Indonesian populations."
      },
      "funFact": {
        "level3": "Some island peoples have MORE Denisovan DNA than Neanderthal DNA!",
        "level4": "The Ayta Magbukon people of the Philippines have the most Denisovan DNA of anyone!",
        "level5": "There were probably multiple groups of Denisovans across Asia - we've only found bones from one!",
        "level6": "Different island populations met different Denisovan groups in Southeast Asia.",
        "level7": "The 'southern Denisovan' was likely better adapted to tropical environments than Siberian Denisovans.",
        "level8": "Multiple Denisovan introgression waves suggest archaic hominins were widespread across Asia and Oceania."
      },
      "ageEstimate": "Introgressed ~30,000-50,000 years ago",
      "isActive": false,
      "functionKnown": "Unknown (population signature)",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["denisovan", "philippines", "indonesia", "multiple-populations"]
    },
    {
      "id": "archaic_keratin",
      "name": "Archaic Hair & Skin Genes",
      "type": "archaic",
      "subtype": "Both Neanderthal & Denisovan",
      "chromosome": "12",
      "start": 52800000,
      "end": 53400000,
      "strand": ".",
      "nickname": "The Caveman Coat Factory",
      "color": "#a855f7",
      "icon": "Shirt",
      "shortDescription": {
        "level3": "Skin and hair genes from both Neanderthals and Denisovans!",
        "level4": "Keratin genes for skin and hair that we inherited from multiple ancient human species.",
        "level5": "Keratin gene cluster with both Neanderthal and Denisovan variants affecting hair and skin structure.",
        "level6": "KRT gene cluster variants from archaic humans under positive selection in Eurasian populations.",
        "level7": "Both Neanderthal and Denisovan haplotypes at keratin loci show elevated frequencies outside Africa.",
        "level8": "Keratin gene cluster archaic introgression demonstrates convergent selection for integumentary adaptation to non-African environments."
      },
      "funFact": {
        "level3": "Your hair and skin might be partly designed by Neanderthals AND Denisovans!",
        "level4": "Ancient humans who lived in cold Europe had thicker skin and different hair - and shared it with us!",
        "level5": "Both Neanderthals and Denisovans contributed to our skin and hair, helping ancestors survive new climates!",
        "level6": "Keratin variants from archaic humans may have helped modern humans adapt to UV and climate.",
        "level7": "Archaic keratin introgression likely facilitated rapid adaptation during the out-of-Africa expansion.",
        "level8": "The convergent selection on archaic keratin haplotypes illustrates the fitness advantage of standing archaic variation."
      },
      "ageEstimate": "Multiple introgression events",
      "isActive": false,
      "functionKnown": "Skin and hair structure",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["neanderthal", "denisovan", "skin", "hair", "adaptation"]
    },
    {
      "id": "archaic_toll_receptor",
      "name": "Archaic Immune Receptors",
      "type": "archaic",
      "subtype": "Toll-like receptors",
      "chromosome": "4",
      "start": 38775000,
      "end": 38830000,
      "strand": ".",
      "nickname": "Ancient Germ Fighters",
      "color": "#a855f7",
      "icon": "Shield",
      "shortDescription": {
        "level3": "Germ-fighting genes from ancient humans that help us today!",
        "level4": "Immune receptor genes from Neanderthals and Denisovans that help detect infections.",
        "level5": "Toll-like receptor variants from archaic humans that enhance detection of bacteria and viruses.",
        "level6": "TLR1, TLR6, and TLR10 haplotypes introgressed from Neanderthals with enhanced pathogen recognition.",
        "level7": "Archaic TLR haplotypes at ~50% frequency in Eurasians show evidence of adaptive introgression.",
        "level8": "TLR cluster introgression demonstrates how archaic alleles pre-adapted to local pathogens provided selective advantages."
      },
      "funFact": {
        "level3": "Neanderthals fought European germs for 200,000 years and gave us their best defenses!",
        "level4": "About half of all Europeans carry Neanderthal immune genes at these locations!",
        "level5": "These archaic immune variants were so useful that they spread through human populations rapidly!",
        "level6": "The rapid spread of these variants demonstrates strong positive selection.",
        "level7": "TLR introgression may have come with tradeoffs - some variants increase allergy risk.",
        "level8": "Archaic TLR introgression exemplifies the complex fitness effects of adaptive archaic alleles."
      },
      "ageEstimate": "Introgressed ~50,000-60,000 years ago",
      "isActive": false,
      "functionKnown": "Pathogen recognition and immune response",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["neanderthal", "immune", "adaptive", "high-frequency"]
    },
    {
      "id": "brca1_region",
      "name": "BRCA1 Gene",
      "type": "disease_gene",
      "subtype": "Cancer predisposition",
      "chromosome": "17",
      "start": 43044295,
      "end": 43125364,
      "strand": "-",
      "nickname": "The Breast Cancer Gene",
      "color": "#ef4444",
      "icon": "Heart",
      "shortDescription": {
        "level3": "A gene that, when broken, makes breast and ovarian cancer much more likely.",
        "level4": "An important DNA repair gene - mutations greatly increase cancer risk in women.",
        "level5": "A tumor suppressor gene whose mutations confer high lifetime risk of breast and ovarian cancer.",
        "level6": "BRCA1 encodes a DNA repair protein; loss-of-function mutations cause hereditary breast-ovarian cancer syndrome.",
        "level7": "BRCA1 mutations confer ~70% lifetime breast cancer risk and ~40% ovarian cancer risk.",
        "level8": "BRCA1 participates in homologous recombination repair; pathogenic variants cause HBOC syndrome with characteristic tumor spectrum."
      },
      "funFact": {
        "level3": "Angelina Jolie has a BRCA1 mutation - she told everyone to raise awareness!",
        "level4": "Some BRCA1 mutations are more common in certain groups, like Ashkenazi Jews.",
        "level5": "BRCA1 testing revolutionized cancer prevention - now people can take action before cancer develops!",
        "level6": "BRCA1 founder mutations occur in ~2% of Ashkenazi Jewish individuals.",
        "level7": "PARP inhibitors now specifically target BRCA-mutant cancers through synthetic lethality.",
        "level8": "BRCA1 haploinsufficiency combined with PARP inhibition creates synthetic lethality in tumor cells."
      },
      "ageEstimate": "Gene conserved; mutations ongoing",
      "isActive": true,
      "functionKnown": "DNA double-strand break repair",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["cancer", "famous-gene", "hereditary", "actionable"]
    },
    {
      "id": "cftr_region",
      "name": "CFTR Gene",
      "type": "disease_gene",
      "subtype": "Recessive disorder",
      "chromosome": "7",
      "start": 117287120,
      "end": 117715971,
      "strand": "+",
      "nickname": "The Cystic Fibrosis Gene",
      "color": "#ef4444",
      "icon": "Wind",
      "shortDescription": {
        "level3": "A gene that, when both copies are broken, causes a disease that makes breathing hard.",
        "level4": "The gene for cystic fibrosis - you need two broken copies to get the disease.",
        "level5": "The chloride channel gene whose mutations cause cystic fibrosis, the most common lethal genetic disease in Caucasians.",
        "level6": "CFTR encodes a chloride channel; homozygous loss-of-function causes cystic fibrosis affecting lungs and pancreas.",
        "level7": "The F508 mutation accounts for ~70% of CF alleles worldwide with clear founder effect in Europeans.",
        "level8": "CFTR mutations cause defective chloride transport leading to viscous secretions, chronic infection, and progressive organ damage."
      },
      "funFact": {
        "level3": "Being a carrier of ONE broken copy might have protected people from cholera!",
        "level4": "About 1 in 25 Caucasians carries a CF mutation but doesn't have the disease!",
        "level5": "CF carrier advantage against cholera/typhoid may explain why the mutation is so common!",
        "level6": "The heterozygote advantage hypothesis for CFTR is similar to sickle cell and malaria.",
        "level7": "New CFTR modulators like ivacaftor can restore function to some mutant proteins.",
        "level8": "CFTR modulator therapy represents a triumph of molecular genetics-to-treatment translation."
      },
      "ageEstimate": "F508 mutation ~52,000 years old",
      "isActive": true,
      "functionKnown": "Chloride ion transport",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["genetic-disease", "famous-gene", "recessive", "treatable"]
    },
    {
      "id": "htt_huntington",
      "name": "HTT Gene (Huntingtin)",
      "type": "disease_gene",
      "subtype": "Repeat expansion",
      "chromosome": "4",
      "start": 3074681,
      "end": 3243960,
      "strand": "+",
      "nickname": "The Huntington's Gene",
      "color": "#ef4444",
      "icon": "Brain",
      "shortDescription": {
        "level3": "A gene where extra DNA repeats cause a brain disease later in life.",
        "level4": "The gene for Huntington's disease - too many CAG repeats cause neurons to die.",
        "level5": "A gene with a CAG trinucleotide repeat; expansion beyond 36 repeats causes Huntington's disease.",
        "level6": "HTT CAG expansion causes toxic polyglutamine aggregation leading to striatal neurodegeneration.",
        "level7": "Huntington's shows anticipation - repeat length tends to increase when passed from father to child.",
        "level8": "HTT aggregation causes selective medium spiny neuron death through disrupted proteostasis and transcriptional dysregulation."
      },
      "funFact": {
        "level3": "Woody Guthrie, the famous folk singer, had Huntington's disease.",
        "level4": "The more CAG repeats you have, the younger you get sick - it's very predictable!",
        "level5": "Huntington's was one of the first genes mapped using linkage analysis in families.",
        "level6": "HD is one of few diseases where genetic test almost perfectly predicts who will develop disease.",
        "level7": "Gene silencing approaches are in clinical trials to treat Huntington's disease.",
        "level8": "Allele-selective HTT lowering strategies aim to reduce mutant huntingtin while preserving wild-type function."
      },
      "ageEstimate": "Expansion mutations recent/recurrent",
      "isActive": true,
      "functionKnown": "Unknown normal function; aggregation causes disease",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["neurological", "repeat-expansion", "famous-gene", "dominant"]
    },
    {
      "id": "dmd_dystrophin",
      "name": "DMD Gene (Dystrophin)",
      "type": "disease_gene",
      "subtype": "X-linked",
      "chromosome": "X",
      "start": 31097677,
      "end": 33339609,
      "strand": "-",
      "nickname": "The Muscle Disease Gene",
      "color": "#ef4444",
      "icon": "Dumbbell",
      "shortDescription": {
        "level3": "The biggest gene in humans! When broken, boys' muscles get weaker and weaker.",
        "level4": "The largest human gene - mutations cause Duchenne muscular dystrophy in boys.",
        "level5": "The largest human gene (2.2 Mb), whose mutations cause Duchenne and Becker muscular dystrophies.",
        "level6": "DMD encodes dystrophin, a structural protein linking the cytoskeleton to the extracellular matrix in muscle.",
        "level7": "Frame-shifting DMD mutations cause severe Duchenne MD; in-frame deletions cause milder Becker MD.",
        "level8": "Dystrophin absence leads to sarcolemmal instability, calcium influx, and progressive myofiber necrosis with fibrofatty replacement."
      },
      "funFact": {
        "level3": "This gene is SO big that it takes 16 HOURS to read from start to finish!",
        "level4": "The DMD gene has 79 exons - most genes have only a few!",
        "level5": "Because it's on the X chromosome, boys get the disease but girls are usually just carriers.",
        "level6": "DMD's huge size (~2.2 Mb) makes it a large mutational target with high de novo mutation rate.",
        "level7": "Exon-skipping antisense oligonucleotides are FDA-approved for specific DMD mutations.",
        "level8": "Dystrophin's large size enables exon-skipping approaches, as internally deleted proteins can retain function."
      },
      "ageEstimate": "Gene conserved; mutations ongoing",
      "isActive": true,
      "functionKnown": "Muscle structural protein",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["largest-gene", "x-linked", "muscular-dystrophy", "famous-gene"]
    },
    {
      "id": "fmr1_fragile_x",
      "name": "FMR1 Gene",
      "type": "disease_gene",
      "subtype": "Repeat expansion",
      "chromosome": "X",
      "start": 147911919,
      "end": 147951125,
      "strand": "-",
      "nickname": "The Fragile X Gene",
      "color": "#ef4444",
      "icon": "Brain",
      "shortDescription": {
        "level3": "A gene where too many repeats cause learning difficulties and autism-like features.",
        "level4": "The gene for Fragile X syndrome - the most common inherited cause of intellectual disability.",
        "level5": "A CGG repeat expansion disorder; the most common inherited cause of intellectual disability and autism.",
        "level6": "FMR1 CGG expansion causes transcriptional silencing and loss of FMRP, essential for synaptic plasticity.",
        "level7": "Full mutations (>200 CGG) cause hypermethylation and gene silencing; premutations cause distinct disorders.",
        "level8": "FMRP regulates mRNA transport and local translation at synapses; its loss disrupts metabotropic glutamate receptor signaling."
      },
      "funFact": {
        "level3": "The gene got its name because the X chromosome looks 'fragile' or broken at that spot!",
        "level4": "Premutation carriers (55-200 repeats) can develop different problems than full mutations!",
        "level5": "Fragile X premutation carriers may develop tremor and balance problems later in life!",
        "level6": "Premutation carriers (~1/150 females) are at risk for FXTAS and premature ovarian insufficiency.",
        "level7": "The premutation paradox: some carriers show RNA-mediated toxicity while others are phenotypically normal.",
        "level8": "FMR1 premutation causes toxic gain-of-function through CGG RNA-mediated mechanisms distinct from full mutation loss-of-function."
      },
      "ageEstimate": "Expansion mutations ongoing",
      "isActive": true,
      "functionKnown": "Synaptic translation regulation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": [
        "intellectual-disability",
        "repeat-expansion",
        "x-linked",
        "autism"
      ]
    },
    {
      "id": "pku_pah",
      "name": "PAH Gene",
      "type": "disease_gene",
      "subtype": "Newborn screening",
      "chromosome": "12",
      "start": 102836889,
      "end": 102958410,
      "strand": "-",
      "nickname": "The PKU Gene",
      "color": "#ef4444",
      "icon": "TestTube",
      "shortDescription": {
        "level3": "A gene that helps break down a part of protein - when broken, a special diet is needed!",
        "level4": "The gene for phenylketonuria - babies are tested at birth so they can start a special diet.",
        "level5": "The phenylalanine hydroxylase gene; mutations cause PKU, treatable with dietary restriction.",
        "level6": "PAH deficiency causes phenylalanine accumulation; dietary treatment prevents intellectual disability.",
        "level7": "PKU was the first inborn error of metabolism treated by dietary modification and screened at birth.",
        "level8": "PAH deficiency demonstrates the power of early detection through newborn screening and metabolic pathway intervention."
      },
      "funFact": {
        "level3": "Every baby born in the US gets tested for PKU with a tiny blood test!",
        "level4": "PKU babies who eat a special low-protein diet grow up totally healthy!",
        "level5": "Before newborn screening, PKU caused severe intellectual disability. Now it's completely preventable!",
        "level6": "PKU treatment is a triumph of biochemical genetics - understanding the pathway enabled rational therapy.",
        "level7": "The aspartame warning 'contains phenylalanine' is specifically for people with PKU.",
        "level8": "PKU exemplifies the paradigm shift from untreatable genetic disease to manageable metabolic condition."
      },
      "ageEstimate": "Gene conserved; mutations ongoing",
      "isActive": true,
      "functionKnown": "Phenylalanine metabolism",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["newborn-screening", "treatable", "metabolic", "success-story"]
    },
    {
      "id": "hbb_sickle_cell",
      "name": "HBB Gene (Beta-Globin)",
      "type": "disease_gene",
      "subtype": "Balancing selection",
      "chromosome": "11",
      "start": 5225464,
      "end": 5229395,
      "strand": "-",
      "nickname": "The Sickle Cell Gene",
      "color": "#ef4444",
      "icon": "Droplet",
      "shortDescription": {
        "level3": "A gene where one broken copy fights malaria, but two cause sickle cell disease.",
        "level4": "The beta-globin gene - sickle cell trait protects against malaria but the disease is serious.",
        "level5": "A classic example of balancing selection: heterozygotes resist malaria, homozygotes have sickle cell disease.",
        "level6": "HBB E6V mutation provides malaria resistance in heterozygotes but causes hemoglobinopathy in homozygotes.",
        "level7": "Sickle cell disease demonstrates heterozygote advantage maintaining deleterious alleles in populations.",
        "level8": "The HBB sickle allele is a textbook example of balanced polymorphism driven by Plasmodium falciparum selection."
      },
      "funFact": {
        "level3": "Having ONE copy of the sickle gene actually PROTECTS you from malaria!",
        "level4": "The sickle cell mutation is common in Africa because malaria is common there!",
        "level5": "This is a famous example of 'heterozygote advantage' - carriers are better off than either homozygote!",
        "level6": "The sickle allele reaches ~15% frequency in some malaria-endemic regions.",
        "level7": "Gene therapy and gene editing approaches are now curing sickle cell disease.",
        "level8": "CRISPR-based therapies reactivating fetal hemoglobin represent revolutionary treatment for sickle cell disease."
      },
      "ageEstimate": "Multiple independent origins 3,000-6,000 years ago",
      "isActive": true,
      "functionKnown": "Oxygen transport (hemoglobin component)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["malaria", "balancing-selection", "famous-gene", "treatable"]
    },
    {
      "id": "supercentenarian_region",
      "name": "Longevity Gene Region",
      "type": "longevity",
      "subtype": "Aging-associated",
      "chromosome": "6",
      "start": 108900000,
      "end": 109000000,
      "strand": ".",
      "nickname": "The Century Gene",
      "color": "#22c55e",
      "icon": "Clock",
      "shortDescription": {
        "level3": "A gene region that might help some people live past 100 years old!",
        "level4": "The FOXO3 gene - variants here are found more often in people who live past 100.",
        "level5": "A FOXO3 region containing variants significantly associated with exceptional longevity across populations.",
        "level6": "FOXO3 variants show consistent association with longevity in multiple independent centenarian studies.",
        "level7": "FOXO3 regulates stress resistance, metabolism, and autophagy - pathways central to aging biology.",
        "level8": "FOXO3 longevity associations replicate across ethnic groups, suggesting fundamental importance in human aging."
      },
      "funFact": {
        "level3": "The same gene that helps worms and flies live longer also helps humans live longer!",
        "level4": "FOXO3 longevity variants are found in centenarians from Japan, Germany, Italy, and America!",
        "level5": "This is one of very few genes consistently linked to extreme longevity across different populations.",
        "level6": "FOXO proteins are evolutionarily conserved regulators of lifespan from worms to humans.",
        "level7": "Modulating FOXO activity extends lifespan in model organisms - a potential therapeutic target.",
        "level8": "FOXO3 represents a rare validated human longevity gene with clear mechanistic links to aging biology."
      },
      "ageEstimate": "Gene conserved; variants ancient",
      "isActive": false,
      "functionKnown": "Stress response and metabolism regulation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["longevity", "centenarian", "aging"]
    },
    {
      "id": "human_specific_deletion",
      "name": "HACNS1 (Human-Specific)",
      "type": "human_specific",
      "subtype": "Evolutionary deletion",
      "chromosome": "2",
      "start": 236773656,
      "end": 236777656,
      "strand": ".",
      "nickname": "The Missing Penis Spines Gene",
      "color": "#ec4899",
      "icon": "Minus",
      "shortDescription": {
        "level3": "A piece of DNA that chimps have but humans lost - it might be why we're different!",
        "level4": "An enhancer that was deleted in humans but exists in all other apes.",
        "level5": "A regulatory element deleted in humans that controls androgen receptor expression in developing tissues.",
        "level6": "A human-specific deletion of an AR enhancer, associated with loss of penile spines and increased brain size.",
        "level7": "This deletion removes an androgen-responsive enhancer, potentially affecting both genital and brain development.",
        "level8": "The hCONDEL at this locus eliminates AR-dependent enhancer activity in developing external genitalia and frontal cortex."
      },
      "funFact": {
        "level3": "Some scientists think this deletion helped human brains get bigger!",
        "level4": "Unlike chimps and gorillas, humans don't have penile spines - this gene explains why!",
        "level5": "This deletion may have contributed to longer mating times in humans compared to chimps!",
        "level6": "Human-specific gene losses can be as important as gains for our unique traits.",
        "level7": "This deletion demonstrates that human evolution involved loss of features, not just gains.",
        "level8": "Phenotypic losses through cis-regulatory deletions represent an underappreciated mechanism of human trait evolution."
      },
      "ageEstimate": "~6 million years (human-specific)",
      "isActive": false,
      "functionKnown": "Lost enhancer for androgen receptor",
      "kidFriendly": false,
      "minCopyLevel": 6,
      "tags": ["human-specific", "deletion", "evolution", "development"]
    },
    {
      "id": "human_specific_srgap2",
      "name": "SRGAP2 Human Duplications",
      "type": "human_specific",
      "subtype": "Gene duplication",
      "chromosome": "1",
      "start": 206333000,
      "end": 206800000,
      "strand": ".",
      "nickname": "The Brain Booster Copies",
      "color": "#ec4899",
      "icon": "CopyPlus",
      "shortDescription": {
        "level3": "Genes that copied themselves only in humans and might have made our brains special!",
        "level4": "A gene that humans copied multiple times, which may have helped our brains develop more connections.",
        "level5": "Human-specific SRGAP2 duplications that affect brain neuron density and spine development.",
        "level6": "SRGAP2B/C are human-specific partial duplications that inhibit ancestral SRGAP2A function in developing brain.",
        "level7": "SRGAP2C duplication ~2.4 MYA coincides with brain expansion and may increase dendritic spine density.",
        "level8": "SRGAP2 paralogs demonstrate how gene duplication and neofunctionalization contributed to human brain evolution."
      },
      "funFact": {
        "level3": "These gene copies only exist in humans - not in chimps or any other animal!",
        "level4": "The duplications happened around when human brains started getting bigger!",
        "level5": "These copies slow down neuron development, which paradoxically makes more brain connections!",
        "level6": "Slower synapse maturation may allow for more complex brain wiring in humans.",
        "level7": "SRGAP2 duplications exemplify how human-specific segmental duplications shaped brain evolution.",
        "level8": "The SRGAP2C paralog acts as a dominant negative, prolonging spine maturation and increasing density."
      },
      "ageEstimate": "~2-3 million years (human-specific)",
      "isActive": false,
      "functionKnown": "Modifies brain neuron development",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["human-specific", "duplication", "brain", "recent-evolution"]
    },
    {
      "id": "human_specific_notch2nl",
      "name": "NOTCH2NL Brain Genes",
      "type": "human_specific",
      "subtype": "Gene duplication",
      "chromosome": "1",
      "start": 146100000,
      "end": 148800000,
      "strand": ".",
      "nickname": "The Brain Size Genes",
      "color": "#ec4899",
      "icon": "Brain",
      "shortDescription": {
        "level3": "Special genes only humans have that might explain why our brains are so big!",
        "level4": "Genes found only in humans that tell brain stem cells to keep dividing and make bigger brains.",
        "level5": "Human-specific NOTCH2NL genes that increase neural progenitor proliferation and brain size.",
        "level6": "NOTCH2NL genes arose ~3-4 MYA through segmental duplication and promote cortical expansion.",
        "level7": "NOTCH2NL amplifies Notch signaling in neural progenitors, delaying differentiation and expanding the progenitor pool.",
        "level8": "NOTCH2NL paralogs promote indirect neurogenesis by maintaining radial glial identity, contributing to human cortical expansion."
      },
      "funFact": {
        "level3": "These genes tell brain cells 'keep growing!' - that's why human brains are so big!",
        "level4": "Deletions in this region can cause microcephaly, and duplications can cause macrocephaly!",
        "level5": "These are some of the newest genes in the human genome - they appeared only 3-4 million years ago!",
        "level6": "NOTCH2NL provides direct mechanistic link between human-specific genes and brain size.",
        "level7": "1q21.1 CNVs involving NOTCH2NL cause neurodevelopmental disorders with altered head size.",
        "level8": "NOTCH2NL discovery provides functional validation for human-specific gene duplications in brain evolution."
      },
      "ageEstimate": "~3-4 million years (human-specific)",
      "isActive": false,
      "functionKnown": "Brain size regulation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["human-specific", "duplication", "brain", "cortical-expansion"]
    },
    {
      "id": "myh16_jaw",
      "name": "MYH16 Jaw Muscle Loss",
      "type": "human_specific",
      "subtype": "Gene inactivation",
      "chromosome": "7",
      "start": 100917379,
      "end": 100971513,
      "strand": "-",
      "nickname": "The Weaker Jaw Gene",
      "color": "#ec4899",
      "icon": "Minus",
      "shortDescription": {
        "level3": "A jaw muscle gene that broke in humans - maybe to make room for bigger brains!",
        "level4": "A muscle gene that stopped working in humans ~2.4 million years ago.",
        "level5": "A myosin gene inactivated ~2.4 MYA, coinciding with brain expansion in human ancestors.",
        "level6": "MYH16 pseudogenization may have relaxed constraints on skull size, facilitating encephalization.",
        "level7": "The MYH16 inactivating mutation dates to ~2.4 MYA, correlating with reduced masticatory apparatus in Homo.",
        "level8": "While correlative, MYH16 inactivation represents a compelling case of gene loss contributing to human morphological evolution."
      },
      "funFact": {
        "level3": "Chimps have super strong jaw muscles. We traded strong jaws for bigger brains!",
        "level4": "The timing of this gene breaking matches exactly when human skulls started changing!",
        "level5": "This is one of the only examples where a broken gene might have made humans better!",
        "level6": "Gene loss can be adaptive - sometimes breaking things makes room for new developments.",
        "level7": "The MYH16 case illustrates that gene loss, not just gain, shapes human evolution.",
        "level8": "Phenotypic trade-offs through gene inactivation may have facilitated human cranial evolution."
      },
      "ageEstimate": "~2.4 million years",
      "isActive": false,
      "functionKnown": "None (jaw muscle protein lost)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["human-specific", "gene-loss", "jaw", "brain-evolution"]
    }
  ]
}
