{
  "version": "1.0.0",
  "build": "GRCh38",
  "lastUpdated": "2024-01-15",
  "typeSummaries": [
    {
      "type": "herv",
      "displayName": "Ancient Virus DNA",
      "description": {
        "level3": "Pieces of old viruses that got stuck in our DNA long ago.",
        "level4": "DNA from viruses that infected our ancestors millions of years ago and became part of our genome.",
        "level5": "Remnants of retroviruses that inserted themselves into our ancestors' DNA millions of years ago.",
        "level6": "Human Endogenous Retroviruses (HERVs) are viral sequences integrated into our genome through ancient infections.",
        "level7": "HERVs are retroviral sequences that integrated into the germline of ancestral primates and were inherited vertically.",
        "level8": "Human Endogenous Retroviruses represent ~8% of the genome, derived from exogenous retroviral infections that integrated into germline cells."
      },
      "color": "#dc2626",
      "icon": "Bug",
      "percentOfGenome": 8
    },
    {
      "type": "line",
      "displayName": "Jumping Genes (LINEs)",
      "description": {
        "level3": "Bits of DNA that can copy themselves and move to new spots.",
        "level4": "DNA sequences that can make copies of themselves and jump to different places in your genome.",
        "level5": "Long stretches of DNA that can duplicate themselves and insert the copy elsewhere in the genome.",
        "level6": "Long Interspersed Nuclear Elements (LINEs) are autonomous retrotransposons capable of self-replication.",
        "level7": "LINEs are class I transposable elements that replicate through an RNA intermediate using reverse transcriptase.",
        "level8": "LINE elements, particularly LINE-1, are autonomous non-LTR retrotransposons constituting ~17% of the human genome with ongoing activity."
      },
      "color": "#2563eb",
      "icon": "Repeat",
      "percentOfGenome": 17
    },
    {
      "type": "sine",
      "displayName": "Alu Elements",
      "description": {
        "level3": "Tiny pieces of DNA that copied themselves over a million times!",
        "level4": "Small bits of DNA that have duplicated themselves over and over, appearing more than a million times.",
        "level5": "Short DNA sequences that have proliferated to over a million copies throughout the human genome.",
        "level6": "SINEs (Short Interspersed Nuclear Elements) like Alu are non-autonomous elements that hijack LINE machinery to copy themselves.",
        "level7": "Alu elements are primate-specific SINEs that depend on LINE-1 proteins for retrotransposition, numbering over 1 million copies.",
        "level8": "Alu elements are ~300bp non-autonomous retrotransposons comprising ~11% of the genome, retrotranspositionally active via LINE-1 machinery."
      },
      "color": "#7c3aed",
      "icon": "Copy",
      "percentOfGenome": 11
    },
    {
      "type": "pseudogene",
      "displayName": "Fossil Genes",
      "description": {
        "level3": "Broken copies of genes that don't work anymore, like fossils in your DNA.",
        "level4": "Old copies of genes that have broken down over time and no longer make proteins.",
        "level5": "Non-functional copies of genes that accumulated mutations and can no longer produce working proteins.",
        "level6": "Pseudogenes are defunct relatives of functional genes that have lost their protein-coding ability through mutations.",
        "level7": "Pseudogenes arise through duplication or retrotransposition and accumulate disabling mutations while preserving sequence similarity to parent genes.",
        "level8": "Pseudogenes are genomic sequences with homology to functional genes but rendered non-functional by frameshift mutations, premature stops, or regulatory defects."
      },
      "color": "#78716c",
      "icon": "Skull",
      "percentOfGenome": 1.5
    },
    {
      "type": "dna_transposon",
      "displayName": "Cut-and-Paste Genes",
      "description": {
        "level3": "DNA pieces that used to be able to cut themselves out and paste somewhere else.",
        "level4": "Ancient DNA sequences that could move around by cutting themselves out and inserting elsewhere.",
        "level5": "DNA transposons that historically moved via a cut-and-paste mechanism, though most are now inactive.",
        "level6": "DNA transposons are Class II transposable elements that mobilized via transposase-mediated excision and reinsertion.",
        "level7": "DNA transposons moved through a conservative cut-and-paste mechanism, unlike retrotransposons' replicative copy-and-paste method.",
        "level8": "DNA transposons constitute ~3% of the genome, mobilizing via transposase enzymes, though all human copies became inactive ~37 MYA."
      },
      "color": "#ea580c",
      "icon": "Scissors",
      "percentOfGenome": 3
    }
  ],
  "features": [
    {
      "id": "herv_syncytin1",
      "name": "Syncytin-1",
      "type": "herv",
      "subtype": "HERV-W",
      "chromosome": "7",
      "start": 92470496,
      "end": 92480871,
      "strand": "-",
      "nickname": "The Pregnancy Virus Gene",
      "color": "#dc2626",
      "icon": "Baby",
      "shortDescription": {
        "level3": "An old virus gene that helps babies grow inside their moms!",
        "level4": "A gene from an ancient virus that now helps connect babies to their mothers during pregnancy.",
        "level5": "A former viral gene that evolved to help form the placenta, connecting mother and baby.",
        "level6": "An endogenous retroviral envelope gene co-opted for placental syncytiotrophoblast fusion.",
        "level7": "HERV-W derived Syncytin-1 mediates cell-cell fusion in placental development, demonstrating viral domestication.",
        "level8": "Syncytin-1 (ERVW-1) is a fusogenic envelope protein derived from HERV-W, essential for syncytiotrophoblast formation."
      },
      "funFact": {
        "level3": "Without this old virus, mammals might not be able to have babies the way we do!",
        "level4": "This virus DNA was captured about 25 million years ago and became essential for pregnancy!",
        "level5": "We essentially repurposed a virus infection to help with pregnancy - talk about making lemonade from lemons!",
        "level6": "Syncytin-1 demonstrates exaptation: a viral gene repurposed for essential host function.",
        "level7": "Multiple mammals independently captured different retroviral envelopes for placentation - convergent evolution at its finest.",
        "level8": "Syncytins represent one of the clearest examples of retroviral domestication across mammalian evolution."
      },
      "ageEstimate": "~25 million years",
      "isActive": false,
      "functionKnown": "Essential for placenta formation",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["pregnancy", "essential", "domesticated-virus"]
    },
    {
      "id": "herv_syncytin2",
      "name": "Syncytin-2",
      "type": "herv",
      "subtype": "HERV-FRD",
      "chromosome": "6",
      "start": 11118934,
      "end": 11128556,
      "strand": "+",
      "nickname": "The Other Pregnancy Helper",
      "color": "#dc2626",
      "icon": "Baby",
      "shortDescription": {
        "level3": "Another virus gene that helps with having babies.",
        "level4": "A second viral gene that helps protect babies in the womb.",
        "level5": "Another domesticated viral gene involved in placental development and immune protection.",
        "level6": "A second retroviral envelope gene with immunosuppressive and fusogenic functions in the placenta.",
        "level7": "HERV-FRD derived Syncytin-2 has both fusogenic and immunosuppressive properties for fetomaternal tolerance.",
        "level8": "Syncytin-2 (ERVFRD-1) provides both cell fusion capability and immunomodulatory function at the maternal-fetal interface."
      },
      "ageEstimate": "~40 million years",
      "isActive": false,
      "functionKnown": "Placenta formation and immune tolerance",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["pregnancy", "essential", "immune"]
    },
    {
      "id": "herv_k_active",
      "name": "HERV-K (HML-2)",
      "type": "herv",
      "subtype": "HERV-K",
      "chromosome": "12",
      "start": 58721242,
      "end": 58730543,
      "strand": "+",
      "nickname": "The Youngest Virus",
      "color": "#dc2626",
      "icon": "Bug",
      "shortDescription": {
        "level3": "The most recent virus that got stuck in human DNA - only about 200,000 years ago!",
        "level4": "The newest virus DNA in humans, inserted around the time modern humans appeared.",
        "level5": "The most recently active human endogenous retrovirus, with some copies still potentially active.",
        "level6": "HERV-K HML-2 represents the youngest HERV family with human-specific insertions and residual coding capacity.",
        "level7": "HERV-K (HML-2) is the only HERV family with human-specific members, some retaining open reading frames.",
        "level8": "HERV-K HML-2 elements include human-specific proviruses with intact ORFs, suggesting recent (<1MYA) and possibly ongoing activity."
      },
      "funFact": {
        "level3": "Some scientists think this virus might still be able to wake up!",
        "level4": "This is so young (for virus DNA) that different people have different copies!",
        "level5": "HERV-K is polymorphic - meaning some people have copies that others don't!",
        "level6": "Some HERV-K insertions are present in only some humans, indicating very recent integration.",
        "level7": "HERV-K polymorphism and potential somatic activity make it unique among human ERVs.",
        "level8": "HERV-K HML-2 shows human-specific polymorphic insertions and evidence of somatic activity in certain pathological conditions."
      },
      "ageEstimate": "200,000 - 5 million years",
      "isActive": true,
      "functionKnown": "Unknown, possibly involved in some diseases",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["recent", "polymorphic", "potentially-active"]
    },
    {
      "id": "line1_active",
      "name": "Active LINE-1",
      "type": "line",
      "subtype": "L1HS",
      "chromosome": "22",
      "start": 29059272,
      "end": 29065348,
      "strand": "+",
      "nickname": "The Still-Jumping Gene",
      "color": "#2563eb",
      "icon": "Repeat",
      "shortDescription": {
        "level3": "A piece of DNA that can still copy itself and move around!",
        "level4": "One of about 100 LINE-1 elements that can still actively jump around in your genome.",
        "level5": "An active retrotransposon that continues to make new copies of itself in human cells.",
        "level6": "A full-length, retrotranspositionally competent LINE-1 element with intact ORFs.",
        "level7": "Active L1HS elements retain functional ORF1p and ORF2p for autonomous retrotransposition.",
        "level8": "This full-length L1HS element (~6kb) contains intact ORF1 (RNA chaperone) and ORF2 (RT/EN) for autonomous mobilization."
      },
      "funFact": {
        "level3": "These jumping genes are still making new copies in your cells right now!",
        "level4": "Out of 500,000 LINE-1 copies, only about 100 can still jump - but they do!",
        "level5": "LINE-1 elements cause about 1 in every 250 disease-causing mutations in humans.",
        "level6": "Active LINE-1s contribute to somatic mosaicism and can cause insertional mutagenesis.",
        "level7": "L1 retrotransposition generates ~80-100 novel insertions per individual per generation.",
        "level8": "Active L1 elements drive ongoing genomic evolution, contributing to structural variation and disease mutations."
      },
      "ageEstimate": "Still active",
      "percentOfGenome": 17,
      "isActive": true,
      "functionKnown": "Creates genomic diversity, sometimes causes disease",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["active", "jumping-gene", "evolution"]
    },
    {
      "id": "line1_disease",
      "name": "Hemophilia LINE-1",
      "type": "line",
      "subtype": "L1",
      "chromosome": "X",
      "start": 139530556,
      "end": 139536632,
      "strand": "-",
      "nickname": "The Disease-Causing Jumper",
      "color": "#2563eb",
      "icon": "AlertTriangle",
      "shortDescription": {
        "level3": "A jumping gene that landed in the wrong spot and causes a blood disease.",
        "level4": "A LINE-1 that jumped into an important gene and caused the first known disease from a jumping gene.",
        "level5": "The first documented case of a transposon insertion causing human disease - hemophilia A.",
        "level6": "A LINE-1 insertion in the Factor VIII gene, the first identified retrotransposon-mediated human disease.",
        "level7": "This L1 insertion in F8 intron 14 was the first demonstration of L1 retrotransposition causing human genetic disease.",
        "level8": "The F8 L1 insertion (1988) established L1 as an active mutagen, disrupting Factor VIII expression and causing hemophilia A."
      },
      "ageEstimate": "Recent (within patient's germline)",
      "isActive": false,
      "functionKnown": "Caused hemophilia A (first documented case)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["disease", "historic-discovery", "mutation"]
    },
    {
      "id": "alu_disease_hotspot",
      "name": "BRCA1 Alu Cluster",
      "type": "sine",
      "subtype": "Alu",
      "chromosome": "17",
      "start": 43044295,
      "end": 43125364,
      "strand": ".",
      "nickname": "The Recombination Trap",
      "color": "#7c3aed",
      "icon": "Copy",
      "shortDescription": {
        "level3": "A bunch of copied DNA bits that sometimes cause mix-ups in an important cancer gene.",
        "level4": "Many Alu copies clustered together that can cause errors when DNA is copied.",
        "level5": "A region dense with Alu elements that promotes harmful recombination in the BRCA1 gene.",
        "level6": "An Alu-rich region in BRCA1 that facilitates pathogenic Alu-mediated deletions and duplications.",
        "level7": "The high Alu density in BRCA1 (~40% of gene) predisposes to non-allelic homologous recombination events.",
        "level8": "BRCA1's exceptionally high Alu content drives Alu-Alu mediated rearrangements, accounting for ~10% of pathogenic variants."
      },
      "ageEstimate": "Various ages (30-65 million years)",
      "percentOfGenome": 11,
      "isActive": false,
      "functionKnown": "Causes genomic instability, contributes to BRCA1 mutations",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["disease", "recombination", "cancer-gene"]
    },
    {
      "id": "alu_neuro",
      "name": "Brain-Active Alu",
      "type": "sine",
      "subtype": "AluY",
      "chromosome": "1",
      "start": 155235824,
      "end": 155236124,
      "strand": "+",
      "nickname": "The Brain Jumper",
      "color": "#7c3aed",
      "icon": "Brain",
      "shortDescription": {
        "level3": "A copy-paste gene piece that's active in brain cells.",
        "level4": "An Alu element that can still jump around, especially in brain cells.",
        "level5": "An active Alu element that retrotransposes in neural progenitor cells, contributing to brain diversity.",
        "level6": "Alu elements show increased retrotransposition in neural progenitors, creating somatic mosaicism.",
        "level7": "L1/Alu activity in neural progenitor cells generates somatic insertions contributing to neuronal diversity.",
        "level8": "Somatic retrotransposition of Alu elements in NPCs contributes to neuronal genome mosaicism and potentially neural diversity."
      },
      "funFact": {
        "level3": "Your brain cells might each have slightly different DNA because of jumping genes!",
        "level4": "Jumping genes are more active in brain cells, making each neuron slightly unique!",
        "level5": "L1 and Alu activity in the brain means your neurons aren't all genetically identical.",
        "level6": "Somatic retrotransposition creates neuronal mosaicism - each brain cell may have unique insertions.",
        "level7": "Neural retrotransposition may contribute to neural circuit diversity and plasticity.",
        "level8": "Elevated L1/Alu somatic activity in neurons may contribute to neural diversity, though functional significance remains debated."
      },
      "ageEstimate": "Ongoing",
      "isActive": true,
      "functionKnown": "May contribute to neural diversity",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["brain", "active", "mosaicism"]
    },
    {
      "id": "pseudogene_olfactory",
      "name": "Olfactory Pseudogene Cluster",
      "type": "pseudogene",
      "subtype": "Processed",
      "chromosome": "11",
      "start": 4923447,
      "end": 5986682,
      "strand": ".",
      "nickname": "The Lost Smell Genes",
      "color": "#78716c",
      "icon": "Wind",
      "shortDescription": {
        "level3": "Old smell genes that stopped working when our ancestors started using their eyes more.",
        "level4": "Broken copies of smell genes - we lost many when vision became more important.",
        "level5": "A cluster of non-functional olfactory receptor genes, remnants of our more smell-dependent ancestors.",
        "level6": "Olfactory receptor pseudogenes representing the decline of smell as humans evolved better color vision.",
        "level7": "The OR gene family shows massive pseudogenization (~60%) correlating with the evolution of trichromatic vision.",
        "level8": "Human olfactory receptor pseudogenes reflect relaxed selection following trichromacy acquisition and olfaction's reduced fitness contribution."
      },
      "funFact": {
        "level3": "Dogs have way fewer broken smell genes, which is why their noses are so much better!",
        "level4": "We have about 400 working smell genes but over 600 broken ones!",
        "level5": "Humans have ~400 functional OR genes but ~600 pseudogenes - dogs have far fewer pseudogenes!",
        "level6": "The human OR repertoire is ~40% functional vs ~80% in dogs, reflecting our visual vs olfactory lifestyle.",
        "level7": "OR pseudogenization accelerated in the catarrhine lineage coincident with full trichromacy evolution.",
        "level8": "Comparative genomics reveals OR pseudogenization rates correlate inversely with olfactory dependence across mammals."
      },
      "ageEstimate": "25-40 million years",
      "isActive": false,
      "functionKnown": "None (fossil of ancestral smell ability)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "smell", "vision-tradeoff"]
    },
    {
      "id": "pseudogene_vitamin_c",
      "name": "GULOP (Vitamin C Gene)",
      "type": "pseudogene",
      "subtype": "Unitary",
      "chromosome": "8",
      "start": 27361291,
      "end": 27386181,
      "strand": "-",
      "nickname": "Why We Need Orange Juice",
      "color": "#78716c",
      "icon": "CircleDot",
      "shortDescription": {
        "level3": "A broken gene that means humans can't make their own Vitamin C!",
        "level4": "The reason we need to eat fruits and vegetables - this gene broke millions of years ago.",
        "level5": "A non-functional vitamin C synthesis gene, explaining why humans require dietary vitamin C.",
        "level6": "GULOP pseudogene lost function ~40 MYA, making vitamin C an essential dietary nutrient for primates.",
        "level7": "The GULO pseudogene contains multiple disabling mutations shared with other simian primates.",
        "level8": "GULOP (L-gulonolactone oxidase pseudogene) carries shared-derived mutations establishing vitamin C auxotrophy in Haplorrhini."
      },
      "funFact": {
        "level3": "Most animals make their own Vitamin C, but we have to eat it because this gene broke!",
        "level4": "Sailors used to get sick (scurvy) because they didn't know they needed vitamin C - blame this gene!",
        "level5": "This broken gene is why scurvy plagued sailors - we can't synthesize vitamin C like most mammals.",
        "level6": "Guinea pigs independently broke their GULO gene, making them useful scurvy research models.",
        "level7": "GULO pseudogenization occurred independently in guinea pigs, some bats, and passerine birds.",
        "level8": "Multiple independent GULO losses across mammals demonstrate parallel evolution under fruit-rich dietary conditions."
      },
      "ageEstimate": "~40 million years",
      "isActive": false,
      "functionKnown": "None (explains vitamin C dietary requirement)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "nutrition", "scurvy"]
    },
    {
      "id": "pseudogene_egg_yolk",
      "name": "Vitellogenin Pseudogenes",
      "type": "pseudogene",
      "subtype": "Unitary",
      "chromosome": "1",
      "start": 2845732,
      "end": 2891643,
      "strand": "+",
      "nickname": "Lost Egg Genes",
      "color": "#78716c",
      "icon": "Egg",
      "shortDescription": {
        "level3": "Broken egg-making genes from when our ancient ancestors laid eggs!",
        "level4": "Leftover genes from egg-laying ancestors - proof that mammals evolved from egg-layers.",
        "level5": "Remnants of vitellogenin genes used by our egg-laying ancestors, replaced by lactation.",
        "level6": "Vitellogenin pseudogenes trace mammalian evolution from oviparity to viviparity and lactation.",
        "level7": "VIT pseudogenization correlates temporally with casein gene expansion during lactation evolution.",
        "level8": "Human vitellogenin pseudogenes show stepwise inactivation coinciding with casein gene family expansion ~100-300 MYA."
      },
      "funFact": {
        "level3": "We still have broken egg genes because we evolved from animals that laid eggs!",
        "level4": "When mammals evolved to make milk, we didn't need egg yolk genes anymore - but they're still there, broken!",
        "level5": "The vitellogenin genes broke as casein (milk protein) genes evolved - we traded eggs for milk!",
        "level6": "Vitellogenin loss and casein emergence show clear evolutionary tradeoff timing.",
        "level7": "The VIT/casein evolutionary transition is a textbook example of gene family replacement.",
        "level8": "VIT pseudogenization dates align with casein gene family radiation, demonstrating molecular basis for oviparity-viviparity transition."
      },
      "ageEstimate": "~100-170 million years",
      "isActive": false,
      "functionKnown": "None (evolutionary relic of egg-laying ancestors)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["evolution", "mammals", "eggs-to-milk"]
    },
    {
      "id": "transposon_charlie",
      "name": "Charlie Element",
      "type": "dna_transposon",
      "subtype": "hAT-Charlie",
      "chromosome": "2",
      "start": 132456789,
      "end": 132458234,
      "strand": "+",
      "nickname": "The Friendly Fossil",
      "color": "#ea580c",
      "icon": "Scissors",
      "shortDescription": {
        "level3": "An ancient jumping gene that stopped jumping millions of years ago.",
        "level4": "A cut-and-paste gene that was active in our distant ancestors but is now a DNA fossil.",
        "level5": "A DNA transposon that was active in early mammals but became immobile ~37 million years ago.",
        "level6": "A hAT-superfamily DNA transposon, part of the Charlie/MER family inactive since ~37 MYA.",
        "level7": "Charlie elements are non-autonomous hAT derivatives that mobilized via ancestral autonomous copies.",
        "level8": "Charlie family elements represent MITEs derived from hAT-family transposons, with activity ceasing in the primate lineage."
      },
      "ageEstimate": "~37 million years (inactive)",
      "isActive": false,
      "functionKnown": "None (genomic fossil)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["fossil", "ancient", "cut-and-paste"]
    },
    {
      "id": "herv_arc",
      "name": "Arc (Activity-Regulated Gene)",
      "type": "herv",
      "subtype": "Ty3/Gypsy",
      "chromosome": "8",
      "start": 142621946,
      "end": 142625963,
      "strand": "-",
      "nickname": "The Memory Virus Gene",
      "color": "#dc2626",
      "icon": "Brain",
      "shortDescription": {
        "level3": "A virus gene that became super important for making memories!",
        "level4": "An ancient virus gene that your brain uses to form and store memories.",
        "level5": "A gene derived from a retrotransposon that's essential for memory formation in the brain.",
        "level6": "Arc encodes a Gag-like protein that forms capsid-like structures for intercellular mRNA transport.",
        "level7": "Arc protein assembles into virus-like capsids that transfer mRNA between neurons for synaptic plasticity.",
        "level8": "Arc represents an exapted Ty3/Gypsy Gag protein that forms capsid-like particles mediating intercellular mRNA transfer at synapses."
      },
      "funFact": {
        "level3": "This virus gene helps your brain cells talk to each other to make memories!",
        "level4": "Arc protein actually makes little virus-like shells to send messages between brain cells!",
        "level5": "Arc makes capsid-like structures (like virus shells) to transport RNA between neurons!",
        "level6": "Arc represents a striking example of viral gene domestication for neural function.",
        "level7": "Arc's virus-like mRNA delivery mechanism suggests retroviral exaptation for neural circuit function.",
        "level8": "Arc exemplifies molecular domestication where Gag's capsid-forming ability was repurposed for synaptic plasticity."
      },
      "ageEstimate": "~350-400 million years",
      "isActive": false,
      "functionKnown": "Essential for memory formation",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["memory", "brain", "domesticated-virus", "essential"]
    },
    {
      "id": "pseudogene_myosin",
      "name": "MYH16 (Jaw Muscle Gene)",
      "type": "pseudogene",
      "subtype": "Unitary",
      "chromosome": "7",
      "start": 100917379,
      "end": 100971513,
      "strand": "-",
      "nickname": "The Brain Space Maker",
      "color": "#78716c",
      "icon": "Bone",
      "shortDescription": {
        "level3": "A muscle gene that broke, letting our heads get bigger for bigger brains!",
        "level4": "A jaw muscle gene that stopped working, possibly letting human skulls grow larger.",
        "level5": "A myosin gene inactivated ~2.4 MYA, coinciding with brain expansion in human evolution.",
        "level6": "MYH16 pseudogenization may have relaxed constraints on skull size, facilitating encephalization.",
        "level7": "The MYH16 inactivating mutation (~2.4 MYA) correlates with reduced masticatory musculature and cranial expansion.",
        "level8": "MYH16 carries a 2-bp deletion creating a frameshift, dated to ~2.4 MYA coincident with Homo brain expansion."
      },
      "funFact": {
        "level3": "Some scientists think breaking this gene helped humans grow bigger brains!",
        "level4": "Weaker jaw muscles might have let our skulls grow bigger to fit larger brains!",
        "level5": "The timing of this gene breaking matches perfectly with when human brains started getting bigger!",
        "level6": "This hypothesis links masticatory muscle reduction to relaxed cranial constraint.",
        "level7": "While correlation is striking, causation between MYH16 loss and encephalization remains debated.",
        "level8": "The MYH16-encephalization hypothesis remains controversial, though temporal correlation is notable."
      },
      "ageEstimate": "~2.4 million years",
      "isActive": false,
      "functionKnown": "None (possibly enabled brain expansion)",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["evolution", "brain", "human-specific"]
    },
    {
      "id": "line1_x_inactivation",
      "name": "X-Chromosome LINE Repeats",
      "type": "line",
      "subtype": "L1",
      "chromosome": "X",
      "start": 73820000,
      "end": 73920000,
      "strand": ".",
      "nickname": "The Silencing Signals",
      "color": "#2563eb",
      "icon": "VolumeX",
      "shortDescription": {
        "level3": "Special markers that help turn off one X chromosome in girls.",
        "level4": "LINE elements that help silence one X chromosome in females, so they don't have double the genes.",
        "level5": "LINE-1 elements enriched on the X chromosome that may facilitate X-inactivation spreading.",
        "level6": "X-chromosome LINE density correlates with X-inactivation efficiency, possibly serving as way stations.",
        "level7": "Lyon's 'way station' hypothesis suggests LINEs propagate heterochromatin during X-inactivation.",
        "level8": "X-chromosome L1 enrichment (~30% vs ~17% autosomal) may facilitate XIST-mediated silencing propagation."
      },
      "funFact": {
        "level3": "Girls have two X chromosomes but only use one - these DNA bits help pick which one!",
        "level4": "The X chromosome has almost twice as many LINE elements as other chromosomes!",
        "level5": "The X chromosome is 30% LINEs (vs 17% elsewhere) - this may help with X-inactivation!",
        "level6": "The 2-fold LINE enrichment on X chromosomes is a striking genomic feature with functional implications.",
        "level7": "X-linked LINE enrichment is conserved across mammals, supporting functional significance.",
        "level8": "Lyon's way-station hypothesis for LINE-mediated X-inactivation spreading remains supported by genomic and functional data."
      },
      "percentOfGenome": 30,
      "isActive": false,
      "functionKnown": "May help spread X-chromosome inactivation",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["x-chromosome", "gene-regulation", "females"]
    },
    {
      "id": "herv_immunity",
      "name": "HERV Immune Regulators",
      "type": "herv",
      "subtype": "Multiple",
      "chromosome": "19",
      "start": 54700000,
      "end": 54800000,
      "strand": ".",
      "nickname": "The Immune Training Grounds",
      "color": "#dc2626",
      "icon": "Shield",
      "shortDescription": {
        "level3": "Old virus bits that help train our immune system!",
        "level4": "HERV sequences that evolved to help regulate how our immune system works.",
        "level5": "Endogenous retroviruses co-opted for interferon response and immune regulation.",
        "level6": "Multiple HERV-derived sequences serve as interferon-stimulated enhancers and immune regulators.",
        "level7": "ERV-derived sequences constitute a significant fraction of primate-specific interferon response elements.",
        "level8": "HERV LTRs provide species-specific cis-regulatory elements for innate immunity genes, particularly in interferon pathways."
      },
      "funFact": {
        "level3": "These old viruses now help us fight new viruses - they switched sides!",
        "level4": "Ancient viruses that once tried to infect us now help our immune system fight other infections!",
        "level5": "ERVs contribute many regulatory elements to our immune response - former enemies turned allies!",
        "level6": "About 20% of human interferon response elements derive from endogenous retroviruses.",
        "level7": "ERV-derived regulatory elements show species-specific immune response patterns.",
        "level8": "ERV domestication for innate immunity represents ongoing host-virus co-evolution with functional consequences."
      },
      "ageEstimate": "Various (millions of years)",
      "isActive": false,
      "functionKnown": "Immune system regulation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["immunity", "regulation", "domesticated-virus"]
    },
    {
      "id": "pseudogene_taste",
      "name": "TAS2R Bitter Receptor Pseudogenes",
      "type": "pseudogene",
      "subtype": "Processed",
      "chromosome": "12",
      "start": 10950000,
      "end": 11150000,
      "strand": ".",
      "nickname": "The Lost Bitter Detectors",
      "color": "#78716c",
      "icon": "Angry",
      "shortDescription": {
        "level3": "Broken taste genes that used to help us detect more bitter things.",
        "level4": "Non-working bitter taste receptor genes, showing we've lost some taste sensitivity.",
        "level5": "Pseudogenized bitter taste receptors reflecting dietary changes in human evolution.",
        "level6": "TAS2R pseudogenes represent relaxed selection on bitter detection as diet shifted.",
        "level7": "Human TAS2R pseudogenization varies by population, reflecting local dietary adaptation.",
        "level8": "TAS2R pseudogene variation shows population-specific patterns correlating with historical dietary toxin exposure."
      },
      "funFact": {
        "level3": "Different people have different broken taste genes, so we all taste things a bit differently!",
        "level4": "Some bitter taste genes are broken in some people but not others - that's why we like different foods!",
        "level5": "TAS2R gene variation explains why some people hate Brussels sprouts while others love them!",
        "level6": "TAS2R variation contributes to individual differences in bitter food preferences.",
        "level7": "Population-specific TAS2R pseudogenization patterns reflect local dietary selective pressures.",
        "level8": "TAS2R copy number and pseudogenization variation represents ongoing neutral evolution and dietary adaptation."
      },
      "ageEstimate": "Ongoing",
      "isActive": false,
      "functionKnown": "None (explains taste variation)",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["taste", "evolution", "dietary-adaptation"]
    },
    {
      "id": "centromeric_alpha_sat",
      "name": "Centromeric Satellites",
      "type": "satellite",
      "subtype": "Alpha satellite",
      "chromosome": "1",
      "start": 122026460,
      "end": 125184587,
      "strand": ".",
      "nickname": "The Chromosome Holders",
      "color": "#84cc16",
      "icon": "Target",
      "shortDescription": {
        "level3": "Special repeating DNA that holds chromosomes together when cells divide.",
        "level4": "Highly repetitive DNA at chromosome centers essential for cell division.",
        "level5": "Alpha satellite DNA at centromeres that enables proper chromosome segregation during cell division.",
        "level6": "Centromeric alpha satellite arrays provide the foundation for kinetochore assembly.",
        "level7": "Alpha satellite higher-order repeats (HORs) establish centromere identity through CENP-A nucleosome positioning.",
        "level8": "Alpha satellite HOR arrays are essential for centromere function, kinetochore assembly, and accurate chromosome segregation."
      },
      "funFact": {
        "level3": "These are the parts that hold your chromosomes in the middle!",
        "level4": "Without this repeating DNA, your chromosomes would get lost when cells divide!",
        "level5": "Centromeric DNA is so repetitive that it was excluded from the 'completed' human genome until 2022!",
        "level6": "The T2T consortium finally sequenced centromeric regions in 2022, completing the human genome.",
        "level7": "Centromeric alpha satellites remained as gaps in GRCh38 until the T2T-CHM13 assembly.",
        "level8": "Complete centromeric sequence assembly required specialized long-read technologies due to repeat complexity."
      },
      "percentOfGenome": 3,
      "isActive": false,
      "functionKnown": "Essential for chromosome segregation",
      "kidFriendly": true,
      "minCopyLevel": 4,
      "tags": ["centromere", "essential", "repetitive"]
    },
    {
      "id": "telomeric_repeats",
      "name": "Telomeric Repeats",
      "type": "satellite",
      "subtype": "Telomere",
      "chromosome": "1",
      "start": 1,
      "end": 10000,
      "strand": ".",
      "nickname": "The Chromosome Caps",
      "color": "#84cc16",
      "icon": "CircleDot",
      "shortDescription": {
        "level3": "Special caps on the ends of chromosomes, like the plastic tips on shoelaces.",
        "level4": "Protective repeating sequences at chromosome ends that prevent DNA damage.",
        "level5": "TTAGGG repeats at chromosome ends that protect DNA and shorten with each cell division.",
        "level6": "Telomeric repeats protect chromosome ends and shorten progressively, limiting replicative lifespan.",
        "level7": "Telomere attrition serves as a mitotic clock; critically short telomeres trigger senescence or apoptosis.",
        "level8": "Telomeric (TTAGGG)n arrays protect chromosome termini; progressive shortening underlies replicative senescence and is counteracted by telomerase in stem/cancer cells."
      },
      "funFact": {
        "level3": "These get shorter every time your cells divide - they're like a countdown clock!",
        "level4": "Your telomeres shorten as you age, which is why scientists study them in aging research.",
        "level5": "Telomere length is linked to aging - some jellyfish stay young by constantly rebuilding theirs!",
        "level6": "Telomere biology won the 2009 Nobel Prize and is central to cancer and aging research.",
        "level7": "Telomerase reactivation is a hallmark of cancer; telomere maintenance is essential for immortalization.",
        "level8": "Telomere biology bridges replicative senescence, stem cell function, aging, and oncogenesis."
      },
      "ageEstimate": "Ancient (conserved across eukaryotes)",
      "isActive": false,
      "functionKnown": "Essential for chromosome stability and aging",
      "kidFriendly": true,
      "minCopyLevel": 3,
      "tags": ["aging", "essential", "chromosome-ends"]
    },
    {
      "id": "alu_rna_editing",
      "name": "RNA Editing Alu",
      "type": "sine",
      "subtype": "Alu inverted",
      "chromosome": "3",
      "start": 128205860,
      "end": 128206460,
      "strand": "-",
      "nickname": "The Message Editor",
      "color": "#7c3aed",
      "icon": "Edit",
      "shortDescription": {
        "level3": "Alu pieces that let your cells edit messages in your RNA!",
        "level4": "Inverted Alu pairs that enable cells to change RNA messages after they're made.",
        "level5": "Alu elements in inverted orientation that create RNA structures subject to A-to-I editing.",
        "level6": "Inverted Alu pairs form dsRNA structures extensively edited by ADAR enzymes.",
        "level7": "Alu-derived dsRNA is the primary substrate for ADAR A-to-I editing in the human transcriptome.",
        "level8": "Primate-specific Alu-mediated A-to-I editing shapes the transcriptome and innate immune dsRNA recognition."
      },
      "funFact": {
        "level3": "Your cells can change the messages in RNA - Alu elements make this possible!",
        "level4": "More than 100 million spots in your RNA can be edited, mostly thanks to Alu elements!",
        "level5": "Humans have millions of A-to-I RNA editing sites, mostly in Alu - more than any other mammal!",
        "level6": "The human editome contains >100 million A-to-I sites, vastly exceeding other mammals.",
        "level7": "Alu-mediated expansion of the editome may contribute to human-specific neural complexity.",
        "level8": "Massive Alu-dependent editome expansion in primates may contribute to neural transcriptome complexity and cognitive evolution."
      },
      "isActive": false,
      "functionKnown": "Enables RNA editing (A-to-I)",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["rna-editing", "innovation", "primate-specific"]
    },
    {
      "id": "segdup_smn",
      "name": "SMN Segmental Duplication",
      "type": "segmental_duplication",
      "subtype": "Interchromosomal",
      "chromosome": "5",
      "start": 70220768,
      "end": 70950000,
      "strand": ".",
      "nickname": "The Backup Gene Copy",
      "color": "#0ea5e9",
      "icon": "CopyPlus",
      "shortDescription": {
        "level3": "An extra backup copy of an important gene that can help if the main one breaks.",
        "level4": "A duplicated region containing SMN genes - having backups can protect against disease.",
        "level5": "The SMN1/SMN2 duplication where SMN2 copy number modifies spinal muscular atrophy severity.",
        "level6": "Segmental duplication created SMN1/SMN2; SMN2 copy number is a key SMA severity modifier.",
        "level7": "SMN2's partial functional redundancy with SMN1 underlies SMA pathogenesis and antisense oligo therapy rationale.",
        "level8": "The SMN1/SMN2 segmental duplication illustrates how paralog redundancy modifies disease phenotypes and enables novel therapeutic strategies."
      },
      "funFact": {
        "level3": "The backup copy (SMN2) is why gene therapy for SMA works!",
        "level4": "Doctors can now use the backup SMN2 gene to help treat spinal muscular atrophy!",
        "level5": "SMN2 copy number varies between people and directly affects SMA disease severity.",
        "level6": "SMN2-targeted therapies (nusinersen, risdiplam) exploit this segmental duplication for treatment.",
        "level7": "The SMN locus exemplifies translational genomics: understanding duplication biology enabled therapy.",
        "level8": "SMN2-directed therapeutics (splice modulators, gene replacement) represent precision medicine enabled by segmental duplication biology."
      },
      "ageEstimate": "~5 million years",
      "isActive": false,
      "functionKnown": "SMN2 modifies SMA disease severity",
      "kidFriendly": true,
      "minCopyLevel": 5,
      "tags": ["disease-modifier", "therapy-target", "duplication"]
    }
  ]
}
